[
  {
    "JobOfferTitle": "Senior Software Developer, C#/.NET",
    "CompanyName": "Motorola Solutions",
    "ContactHiringSection": "",
    "Description": "About the job\r\nCompany Overview\r\n\r\nAt Motorola Solutions, we believe that everything starts with our people. We’re a global close-knit community, united by the relentless pursuit to help keep people safer everywhere. Our critical communications, video security and command center technologies support public safety agencies and enterprises alike, enabling the coordination that’s critical for safer communities, safer schools, safer hospitals and safer businesses. Connect with a career that matters, and help us build a safer future.\r\n\r\nAperçu de l’entreprise\r\n\r\nChez Motorola Solutions, nous pensons que tout commence par nos employés. Nous sommes une communauté mondiale soudée, unie par la volonté incessante de contribuer à la sécurité des personnes partout dans le monde. Nos technologies de communication, de sécurité vidéo et de centre de commandement essentielles soutiennent les agences de sécurité publique et les entreprises, permettant une coordination essentielle pour des communautés, des écoles, des hôpitaux et des entreprises plus sécuritaires. Connectez-vous à une carrière qui compte et aidez-nous à bâtir un avenir plus sûr.\r\n\r\nDepartment Overview\r\n\r\nMotorola Solution’s Video Division is defining the future of the security industry through innovative end-to-end-solutions. We’re changing the landscape of the surveillance industry through advanced award-winning AI based surveillance systems. Artificial Intelligence is transforming the world and our team is advancing the field as it applies to the surveillance industry. We are proud to be industry leaders in video analytics with products like Appearance Search and Unusual Motion Detection along with our recently launched Avigilon cloud service platform. You will have the opportunity to contribute to intelligent camera surveillance systems through cutting edge research and software engineering.\r\n\r\nJob Description\r\n\r\nWe are seeking a Senior Software Developer experienced in .NET & Azure Cloud development in C#.\r\n\r\nResponsibilities include:\r\n\r\nCreate cutting edge web applications. Candidates should feel comfortable transitioning from back end web projects along and desktop projects. \r\nRegardless of tech stack, candidate should be focused on usability, responsiveness, scalability, testability and best coding and design practices\r\nPeer review code for adherence to coding standards and design guidelines\r\nMentoring peers and scrum team building\r\nCollaborate with UX and visual designers on proposed designs\r\nCollaborate with the Automation and Test team on identifying test cases for new features and regression testing\r\nBuild and deploy your microservices in Kubernetes\r\n\r\nQualifications:\r\n\r\nBachelor’s degree in Computer Science or a related technical discipline\r\n5+ years of experience writing in a C# or similar language\r\n5+ years of experience building and maintaining .NET Web Applications\r\nSolid understanding of data structures, asynchronous architectures and building data-intensive applications\r\nExperience with developing cloud applications\r\nYou are equally excited to build a minimum viable product as you are cementing a feature in maintainable and tested code\r\nExcellent written and oral communication skills, including the ability to produce clear, concise documentation\r\nExperience with managing cloud resources and building CI/CD pipelines\r\nExperience designing and building microservices\r\nExperience developing RESTful API's used with web browsers, backend servers, or mobile applications\r\n\r\nNice to have:\r\n\r\nExperience with React\r\nExperience with AI/machine learning technologies is strongly preferred\r\n\r\nThis position is based in Vancouver, BC and the candidate must reside in the Greater Vancouver Area as you will be required to go into the office on a hybrid work schedule.\r\n\r\nThe base salary for this position in British Columbia is 62,600 - 130,000 CAD depending on experience.\r\n\r\nBasic Requirements\r\n\r\nBachelors Degree\r\n4+ years of software development experience\r\n\r\nTravel Requirements\r\n\r\nUnder 10%\r\n\r\nRelocation Provided\r\n\r\nNone\r\n\r\nPosition Type\r\n\r\nExperienced\r\n\r\nReferral Payment Plan\r\n\r\nYes\r\n\r\nEEO Statement\r\n\r\nMotorola Solutions is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion or belief, sex, sexual orientation, gender identity, national origin, disability, veteran status or any other legally-protected characteristic.\r\n\r\nWe are proud of our people-first and community-focused culture, empowering every Motorolan to be their most authentic self and to do their best work to deliver on the promise of a safer world. If you’d like to join our team but feel that you don’t quite meet all of the preferred skills, we’d still love to hear why you think you’d be a great addition to our team.\r\n\r\nWe’re committed to providing an inclusive and accessible recruiting experience for candidates with disabilities, or other physical or mental health conditions. To request an accommodation, please complete this Reasonable Accommodations Form so we can assist you.\r\n\r\nMotorola Solutions adopte, favorise et promeut les principes de diversité, d’équité et d’inclusion. Nous encourageons et accueillons les candidatures de toutes les personnes qualifiées, quelles que soient leur race, origines ethnique, religion ou croyance, orientation sexuelle, identité et expression sexuelle, statut d’anciens combattants ou tout autre statut protégé par la Loi.\r\n\r\nNous sommes fiers de notre culture axée sur les personnes et les communautés, encourageant ainsi chaque Motorolan d’être la version la plus authentique de lui-même dans ses responsabilités afin de tenir la promesse d’un monde plus sécuritaire.\r\n\r\nSi vous souhaitez vous joindre à notre communauté mais croyez que vous ne possédez pas toutes les exigences requises pour le poste convoité, nous aimerions tout de même connaître les raisons pour lesquelles vous pensez être un excellent candidat pour notre équipe.\r\n\r\nNous offrons également des mesures d’adaptation pendant toutes les étapes du processus d’embauche afin de favoriser l’inclusion des personnes vivant avec un handicap physique et/ou mental. Pour demander un aménagement, veuillez remplir ce formulaire d'aménagement raisonnable afin que nous puissions vous aider.",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4248904997/",
    "Applicants": "Vancouver, BC · 6 days ago · 93 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Intermediate II C# Developer",
    "CompanyName": "Global Relay",
    "ContactHiringSection": "",
    "Description": "About the job\r\nWho we are:\r\n\r\nFor over 20 years, Global Relay has set the standard in enterprise information archiving with industry-leading cloud archiving, surveillance, eDiscovery, and analytics solutions. We securely capture and preserve the communications data of the world’s most highly regulated firms, giving them greater visibility and control over their information and ensuring compliance with stringent regulations.\r\n\r\nThough we offer competitive compensation and benefits and all the other perks one would expect from an established company, we are not your typical technology company. Global Relay is a career-building company. A place for big ideas. New challenges. Groundbreaking innovation. It’s a place where you can genuinely make an impact – and be recognized for it.\r\n\r\nWe believe great businesses thrive on diversity, inclusion, and the contributions of all employees. To that end, we recruit candidates from different backgrounds and foster a work environment that encourages employees to collaborate and learn from each other, completely free of barriers.\r\n\r\nYour role:\r\n\r\nAs an Intermediate C# Developer at Global Relay, you’ll be using leading edge technologies to build pioneering products that are used by tens of thousands of users globally to solve real world business problems. You will tackle interesting and engaging problems regarding scalability and high availability in big data environments. At Global Relay we are continuously pushing the boundaries of C# technology.\r\n\r\nThis is an opportunity to work alongside some of the best C# developers in Vancouver and apply your craft in an environment that encourages creative thinking and autonomy. Our software is developed by small, focused, and agile teams of developers and QA. We encourage our developers to think beyond a single component to build complete system solutions. Challenge yourself by learning new technologies, and apply your skills across our different projects and application domains. If you are committed to code that is clean, well-tested, well-reviewed, performant, and secure then you’ll fit in around here.\r\n\r\nYour responsibilities:\r\n\r\n\r\nWork as part of an agile development team to write C# code for enterprise services\r\nWrite unit and integration tests for your C# code\r\nDesign, in collaboration with team, the software implementations that satisfy business requirements\r\nCollaborate with QA in development of test cases for C# code\r\nDevelop deployment systems for C# based systems\r\nDocument code and document detail designs\r\nCollaborate with product owners on user story generation and refinement\r\nMonitor and support operation of production systems\r\nParticipate in knowledge sharing activities with colleagues\r\n\r\n\r\nAbout you:\r\n\r\n\r\nMinimum 5 years of C# developer experience\r\nExperience with multi-threaded programming and design patterns\r\nExperience with Java or another OOP language is an asset\r\nExperience with agile development methodologies\r\nExperience with test driven development, continuous integration systems, and dependency injection containers\r\nExperience with network protocols such as HTTP, TLS, TCP\r\nExperience with service-oriented architecture including Thrift, REST, and JSON\r\nExperience with object relational mapping architecture including T-SQL, NHibernate, Entity Framework\r\n\r\n\r\nCompensation:\r\n\r\nGlobal Relay advertises the pay range for this role in compliance with British Columbia’s pay transparency laws. Individual pay rates are determined by evaluating factors such as expertise, skills, education, and professional background.\r\n\r\nThe range below reflects the expected annual base salary, which is only one element of our comprehensive total rewards package designed to reflect our company pay philosophy, culture and values. We aim to foster an inspiring work environment and support employees' work-life rhythms. We provide a comprehensive extended health benefits program, including virtual healthcare and a wellness allowance. Employees also receive annual allotted vacation days, which increase based on tenure. Other benefits include: Paid sick days, maternity/parental enhancement program, corporate bonuses, and an RRSP contribution matching program.\r\n\r\nFor Vancouver-based employees, we provide a subsidized meal program, courtesy of our talented in-house culinary team!\r\n\r\nBritish Columbia - Base Salary Range:\r\n\r\n$80,000—$100,000 CAD\r\n\r\nWhat you can expect:\r\n\r\nAt Global Relay, there’s no ceiling to what you can achieve. It’s the land of opportunity for the energetic, the intelligent, the driven. You’ll receive the mentoring, coaching, and support you need to reach your career goals. You’ll be part of a culture that breeds creativity and rewards perseverance and hard work. And you’ll be working alongside smart, talented individuals from diverse backgrounds, with complementary knowledge and skills.\r\n\r\nGlobal Relay is an equal-opportunity employer committed to diversity, equity, and inclusion.\r\n\r\nWe seek to ensure reasonable adjustments, accommodations, and personal time are tailored to meet the unique needs of every individual.\r\n\r\nWe understand flexible work arrangements are important, and we encourage that in our work culture. Whether it’s flexibility around work hours, workstyle, or lifestyle, we want to ensure our employees have a healthy work/life balance. We support and value a hybrid work model that blends collaboration with the team in the office and focus time from the comfort of your home.\r\n\r\nTo learn more about our business, culture, and community involvement, visit www.globalrelay.com.",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4230196669/",
    "Applicants": "Vancouver, BC · Reposted 2 weeks ago · Over 100 applicants\r\nPromoted by hirer · No response insights available yet",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Sr. Full Stack .Net Developer",
    "CompanyName": "Corpay",
    "ContactHiringSection": "",
    "Description": "About the job\r\nWhat We Need\r\n\r\nCorpay is currently looking to hire a Senior Fullstack .NET Developer within our Buyatab division. This position falls under our SVS (Stored Value Solutions) line of business and is located in Vancouver, Canada. In the role, the Senior Fullstack .NET Developer will have a wealth of hands-on experience using C# and .NET technologies. You are passionate about agile methodology, and want to contribute to a fast paced, highly collaborative Scrum team. You love learning, being challenged, and challenging others to grow and improve. You bring creative ideas and novel approaches to solving problems.\r\n\r\nHow We Work\r\n\r\nAs a Senior Fullstack .NET Developer, you will be expected to work in a hybrid environment at our Vancouver, Canada office location. Corpay will set you up for success by providing:\r\n\r\n Company-issued equipment \r\n Assigned workspace in a hybrid environment \r\n Formal, hands-on training \r\n\r\nRole Responsibilities\r\n\r\n Providing technical direction, planning, and vision to development team members. \r\n As a lead programmer on new projects, creating, maintaining, and owning technical specifications, designs, and schedules with little direction from manager \r\n Forging strong relationships across departments and to other companies. Communicates programming needs and interests to product team and others. \r\n Anticipating and acts upon issues and problems that arise, providing alternative approaches and solutions. \r\n Architecting and implementing significant portions of code, leveraging work across more than one product. \r\n Seeking out new tools and techniques to facilitate work. \r\n Insisting on highest quality in own work and that of others. \r\n Designing and implementing complex transaction control systems involving secure web application development and integrating with third party web services \r\n Refactoring and migrating legacy applications to distributed application architecture in AWS cloud \r\n Leading by example \r\n\r\nQualifications & Skills\r\n\r\n 8+ years of experience using C#, Javascript and debugging techniques for developing ASP.Net, Asp.Net Core applications \r\n B.S./M.S. in Computer Science, experience in developing two or more commercially used applications, or equivalent experience \r\n Experience building applications using .Net Full Framework (4.0 – 4.8) and .Net (2.2 – 7.0) \r\n Expert in using web technologies, such as HTML, CSS, Javascript, Internet technologies, communication protocols, and techniques \r\n Experience in building applications using React, Redux / Flux, KnockoutJS \r\n Experience with database methodologies and database systems including SQL Server and MongoDB. \r\n Has knowledge of current software design practices, including modularity, event-driven architecture, object-oriented design, interface design, localization, portability, extensibility, and testability \r\n Has experience working in a Scrum / Agile development environment with great understanding of CI / CD practices \r\n Has good communication skills \r\n Self-motivated and works with minimal supervision \r\n\r\nThis salary range is provided for locations which require such disclosure. Where a position or applicant may fall in a particular wage range varies depending on a number of factors, including but not limited to skill sets, experience, training, licensure and certifications (if applicable), and other business and organization needs. The disclosed range has not been adjusted for the applicable geographic markets. At Corpay, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case. An estimate of the minimum and maximum salary range is $115,000 -$125,000 per annum.\r\n\r\nBenefits & Perks\r\n\r\n Comprehensive Benefits Package including, Medical, Dental, Vision and Paramedical benefits, as of day one \r\n Optional company match RRSP program \r\n Virtual fitness classes offered company-wide \r\n Time-off including major holidays, vacation, sick, personal, & volunteer time \r\n Discounted gym membership rate \r\n Philanthropic support with both local and national organizations \r\n Fun culture with company-wide contests and prizes \r\n\r\nOur Company & Purpose\r\n\r\nCorpay is a global leader in business payments, laser focused on developing smarter ways for businesses to pay their expenses. Since 2000, Corpay has developed innovative digital solutions that help businesses better track, manage, and pay their expenses. Today, Corpay is an S&P 500 company with hundreds of thousands of customers using our products in over 100 countries. Companies of all sizes, industries and geographies rely on our product portfolio to manage spending more quickly, efficiently and securely than ever before.\r\n\r\nWe embrace a culture grounded in five key values: integrity, collaboration, innovation, execution and people. These values offer you the opportunity to ‘thrive & grow’ through career development, volunteer, community, and wellness initiatives. This allows you to create a balance between professional goals and personal achievement.\r\n\r\nCorpay is also committed to building and nurturing a culture of diversity, inclusion, equality, and belonging by:\r\n\r\n Welcoming people of different backgrounds, cultures, ethnicities, genders, and sexual orientations; \r\n Empowering our people to share their experiences and ideas through open forums and individual conversations; and \r\n Valuing each person’s unique perspectives and individual contributions. \r\n\r\nEmbracing diversity enables our people to “make the difference” as Corpay and its more than 8,000 employees continue to shape the future of global payments. Learn more by visiting www.corpay.com or following Corpay on LinkedIn .\r\n\r\n Equal Opportunity/Affirmative Action Employer \r\n\r\nCorpay is an Equal Opportunity Employer. Corpay provides equal employment opportunities to all employees and applicants without regard to race, color, gender (including pregnancy), religion, national origin, ancestry, disability, age, sexual orientation, gender identity or expression, marital status, language, ancestry, genetic information, veteran and/or military status or any other group status protected by federal or local law. If you require reasonable accommodation for the application and/or interview process, please notify a representative of the Human Resources Department.\r\n\r\n For more information about our commitment to equal employment opportunity and pay transparency, please click the following links: EEO and Pay Transparency \r\n\r\nApply Now",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4188413939/",
    "Applicants": "Vancouver, BC · Reposted 6 days ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Sr. Full Stack .Net Developer",
    "CompanyName": "Corpay",
    "ContactHiringSection": "",
    "Description": "About the job\r\nWhat We Need\r\n\r\nCorpay is currently looking to hire a Senior Full .NET Stack Developerwithin our Buyatabdivision. This position falls under our SVS (Stored Value Solutions)line of business and is located in Vancouver, Canada. In the role, the Senior Full .NET Stack Developer will have a wealth of hands-on experience using C# and .NET technologies. You are passionate about agile methodology, and want to contribute to a fast paced, highly collaborative Scrum team. You love learning, being challenged, and challenging others to grow and improve. You bring creative ideas and novel approaches to solving problems.\r\n\r\nHow We Work\r\n\r\nAs a Senior Full .NET Stack Developer, you will be expected to work in a hybrid environment reporting our Vancouver, Canada office location. Corpay will set you up for success by providing:\r\n\r\n Company-issued equipment \r\n Assigned workspace in a hybrid environment \r\n Formal, hands-on training \r\n Monthly home internet stipend \r\n\r\nRole Responsibilities\r\n\r\nThe responsibilities of the role will include:\r\n\r\n Providing technical direction, planning, and vision to development team members. \r\n As a lead programmer on new projects, creating, maintaining, and owning technical specifications, designs, and schedules with little direction from manager \r\n Forging strong relationships across departments and to other companies. Communicates programming needs and interests to product team and others. \r\n Anticipating and acts upon issues and problems that arise, providing alternative approaches and solutions. \r\n Architecting and implementing significant portions of code, leveraging work across more than one product. \r\n Seeking out new tools and techniques to facilitate work. \r\n Insisting on highest quality in own work and that of others. \r\n Designing and implementing complex transaction control systems involving secure web application development and integrating with third party web services \r\n Refactoring and migrating legacy applications to distributed application architecture in AWS cloud \r\n Leading by example \r\n\r\nQualifications & Skills\r\n\r\n 8+ years of experience using C#, Javascript and debugging techniques for developing ASP.Net, Asp.Net Core applications \r\n B.S./M.S. in Computer Science, experience in developing two or more commercially used applications, or equivalent experience \r\n Experience building applications using .Net Full Framework (4.0 – 4.8) and .Net (2.2 – 7.0) \r\n Expert in using web technologies, such as HTML, CSS, Javascript, Internet technologies, communication protocols, and techniques \r\n Experience in building applications using React, Redux / Flux, KnockoutJS \r\n Experience with database methodologies and database systems including SQL Server and MongoDB. \r\n Has knowledge of current software design practices, including modularity, event-driven architecture, object-oriented design, interface design, localization, portability, extensibility, and testability \r\n Has experience working in a Scrum / Agile development environment with great understanding of CI / CD practices \r\n Has good communication skills \r\n Self-motivated and works with minimal supervision \r\n\r\nCompensation\r\n\r\nThe salary range for this role is $115,000 -$125,000 CAD annually. We consider several factors when determining a proposed salary range, including but not limited to: experience, education, location, budget, and internal equity. Our compensation philosophy emphasizes fairness and consistency, and job offers will be evaluated case-by-case.\r\n\r\nBenefits & Perks\r\n\r\n Comprehensive Benefits Package including, Medical, Dental, Vision and Paramedical benefits, as of day one \r\n Optional company match RRSP program \r\n Virtual fitness classes offered company-wide \r\n Time-off including major holidays, vacation, sick, personal, & volunteer time \r\n Discounted gym membership rate \r\n Philanthropic support with both local and national organizations \r\n Fun culture with company-wide contests and prizes \r\n\r\nEqual Opportunity/Affirmative Action Employer\r\n\r\nCorpay is an Equal Opportunity Employer. Corpay provides equal employment opportunities to all employees and applicants without regard to race, color, gender (including pregnancy), religion, national origin, ancestry, disability, age, sexual orientation, gender identity or expression, marital status, language, ancestry, genetic information, veteran and/or military status or any other group status protected by federal or local law. If you require reasonable accommodation for the application and/or interview process, please notify a representative of the Human Resources Department.\r\n\r\nFor more information about our commitment to equal employment opportunity and pay transparency, please click the following links:  EEO  and  Pay Transparency\r\n\r\n#CORPAY\r\n\r\nApply Now",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4127166956/",
    "Applicants": "Vancouver, BC · Reposted 1 day ago · Over 100 applicants\r\nPromoted by hirer · Actively reviewing applicants",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Sr. Full Stack .Net Developer",
    "CompanyName": "Corpay",
    "ContactHiringSection": "",
    "Description": "About the job\r\nWhat We Need\r\n\r\nCorpay is currently looking to hire a Senior Full .NET Stack Developerwithin our Buyatabdivision. This position falls under our SVS (Stored Value Solutions)line of business and is located in Vancouver, Canada. In the role, the Senior Full .NET Stack Developer will have a wealth of hands-on experience using C# and .NET technologies. You are passionate about agile methodology, and want to contribute to a fast paced, highly collaborative Scrum team. You love learning, being challenged, and challenging others to grow and improve. You bring creative ideas and novel approaches to solving problems.\r\n\r\nHow We Work\r\n\r\nAs a Senior Full .NET Stack Developer, you will be expected to work in a hybrid environment reporting our Vancouver, Canada office location. Corpay will set you up for success by providing:\r\n\r\n Company-issued equipment \r\n Assigned workspace in a hybrid environment \r\n Formal, hands-on training \r\n Monthly home internet stipend \r\n\r\nRole Responsibilities\r\n\r\nThe responsibilities of the role will include:\r\n\r\n Providing technical direction, planning, and vision to development team members. \r\n As a lead programmer on new projects, creating, maintaining, and owning technical specifications, designs, and schedules with little direction from manager \r\n Forging strong relationships across departments and to other companies. Communicates programming needs and interests to product team and others. \r\n Anticipating and acts upon issues and problems that arise, providing alternative approaches and solutions. \r\n Architecting and implementing significant portions of code, leveraging work across more than one product. \r\n Seeking out new tools and techniques to facilitate work. \r\n Insisting on highest quality in own work and that of others. \r\n Designing and implementing complex transaction control systems involving secure web application development and integrating with third party web services \r\n Refactoring and migrating legacy applications to distributed application architecture in AWS cloud \r\n Leading by example \r\n\r\nQualifications & Skills\r\n\r\n 8+ years of experience using C#, Javascript and debugging techniques for developing ASP.Net, Asp.Net Core applications \r\n B.S./M.S. in Computer Science, experience in developing two or more commercially used applications, or equivalent experience \r\n Experience building applications using .Net Full Framework (4.0 – 4.8) and .Net (2.2 – 7.0) \r\n Expert in using web technologies, such as HTML, CSS, Javascript, Internet technologies, communication protocols, and techniques \r\n Experience in building applications using React, Redux / Flux, KnockoutJS \r\n Experience with database methodologies and database systems including SQL Server and MongoDB. \r\n Has knowledge of current software design practices, including modularity, event-driven architecture, object-oriented design, interface design, localization, portability, extensibility, and testability \r\n Has experience working in a Scrum / Agile development environment with great understanding of CI / CD practices \r\n Has good communication skills \r\n Self-motivated and works with minimal supervision \r\n\r\nCompensation\r\n\r\nThe salary range for this role is $110,000 -$125,000 CAD annually. We consider several factors when determining a proposed salary range, including but not limited to: experience, education, location, budget, and internal equity. Our compensation philosophy emphasizes fairness and consistency, and job offers will be evaluated case-by-case.\r\n\r\nBenefits & Perks\r\n\r\n Comprehensive Benefits Package including, Medical, Dental, Vision and Paramedical benefits, as of day one \r\n Optional company match RRSP program \r\n Virtual fitness classes offered company-wide \r\n Time-off including major holidays, vacation, sick, personal, & volunteer time \r\n Discounted gym membership rate \r\n Philanthropic support with both local and national organizations \r\n Fun culture with company-wide contests and prizes \r\n\r\nEqual Opportunity/Affirmative Action Employer\r\n\r\nCorpay is an Equal Opportunity Employer. Corpay provides equal employment opportunities to all employees and applicants without regard to race, color, gender (including pregnancy), religion, national origin, ancestry, disability, age, sexual orientation, gender identity or expression, marital status, language, ancestry, genetic information, veteran and/or military status or any other group status protected by federal or local law. If you require reasonable accommodation for the application and/or interview process, please notify a representative of the Human Resources Department.\r\n\r\nFor more information about our commitment to equal employment opportunity and pay transparency, please click the following links:  EEO  and  Pay Transparency\r\n\r\n#CORPAY #INDTECH\r\n\r\nApply Now",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4127169678/",
    "Applicants": "Vancouver, BC · Reposted 2 weeks ago · Over 100 applicants\r\nPromoted by hirer · Actively reviewing applicants",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Senior Software Application Developer (.net)",
    "CompanyName": "ITjobs.ca",
    "ContactHiringSection": "",
    "Description": "About the job\r\nThe FortiCare team of the IT Department at Fortinet is looking for a Senior Software Applications Developer who is eager to work on multi-tier web applications, microservices, and the latest web client technologies. This team develops and supports multiple applications including product registration, order fulfillment, service contract/license management, service renewal, and a CRM support ticket application. The FortiCare systems are pure 3-tier web applications using MS .Net technologies and MS SQL Server as the backend database. The ideal candidate will have an opportunity to work alongside very experienced developers and enhance their software architecture and design skillset.\r\n\r\nJob Responsibilities\r\n\r\nUnderstand the company's business processes for product entitlement/license management, product renewals, and customer support\r\nUnderstand system specifications and application high-level designs\r\nComplete application detail designs\r\nApply a strong knowledge of Microsoft stack including C#, Web API 2 and SQL Server\r\nCooperate with front-end developers in the process of creating RESTful APIs\r\nParticipate in daily scrum meetings and take ownership of assigned stories\r\n\r\nJob Skills Required for Back-end C# Developer\r\n\r\n7+ years of .Net web applications programming experience\r\n7+ years SQL Server/T-SQL programming experience\r\nUnderstanding of web technologies like HTML5, CSS3, XML, JavaScript, AJAX, JSON, Web Service, etc.\r\nUnderstanding of OO design and commonly used web application programming patterns like MVC, etc.\r\nUnderstanding of application development methodologies and lifecycle management\r\nKnowledge of Microsoft Azure services such as App Service, Blob Storage, Azure SQL, Azure Functions, etc. is a plus\r\n\r\nThe Canada base salary range for this full-time position is expected to be between $80,000 - $125,000 annually. Wage ranges are based on various factors including the labour market, job type, and job level. Exact salary offers will be determined by factors such as the candidate's subject knowledge, skill level, qualifications, and experience.\r\n\r\nFortinet strives to provide you and your family with a comprehensive benefits package. Benefits eligibility starts on your first day of hire and comprises of 100% company paid medical, dental, and vision coverage, including a Health Spending Account and a Personal Spending Account that gives you flexibility to spend where you need it the most. Our Employee & Family Assistance Plan (EFAP) offers you and your family access to various services like counseling, legal advice, mental health resources etc. We also provide critical illness, disability, and life insurance, as well as a Group Registered Retirement Savings Plan (RRSP) with a company match to help you save faster for retirement. We offer competitive Paid Time Off and flexible leave policies, including paid health days, to help you take care of yourself and your family members.\r\n\r\nAll roles are eligible to participate in the Fortinet equity program. Bonus eligibility is reviewed at time of hire and annually at the Company's discretion.\r\n\r\nWhy Join Us\r\n\r\nWe encourage candidates from all backgrounds and identities to apply. We offer a supportive work environment and a competitive Total Rewards package to support you with your overall health and financial well-being. Embark on a challenging, enjoyable, and rewarding career journey with Fortinet. Join us in bringing solutions that make a meaningful and lasting impact to our 660,000+ customers around the globe.\r\n\r\n#GD\r\n\r\nSaveRemove\r\n\r\nshare-facebook\"> \" class=\"cls-1\" d=\"M15,0A15,15,0,1,0,30,15,15,15,0,0,0,15,0Zm3.25,15H16v8H13V15H11V12h2V10.71c0-1.27.29-3.26,2.94-3.26H18V10H16.76a0.83,0.83,0,0,0-.76.87V12h2.54Z\"> share-twitter\"> \" class=\"cls-1\" d=\"M15,0A15,15,0,1,0,30,15,15,15,0,0,0,15,0Zm5.79,12.39c0,0.12,0,.25,0,0.37A8.31,8.31,0,0,1,8,19.77c0.23,0,.46,0,0.7,0a5.94,5.94,0,0,0,3.65-1.25,2.91,2.91,0,0,1-2.71-2,4.07,4.07,0,0,0,.61,0,4.22,4.22,0,0,0,.87-0.1A2.76,2.76,0,0,1,9,13.61v0a1.33,1.33,0,0,0,1.12.37A3.11,3.11,0,0,1,8.6,11.51,2.91,2.91,0,0,1,9,10a8.29,8.29,0,0,0,6,3,2.93,2.93,0,0,1,5-2.67,5.69,5.69,0,0,0,1.85-.71,2.88,2.88,0,0,1-1.28,1.62,6,6,0,0,0,1.68-.46A6,6,0,0,1,20.79,12.39Z\"> share-linkedin\"> \" class=\"cls-1\" d=\"M16.19,13.74a0,0,0,0,0,0,0v0h0Z\"> \"> \" class=\"cls-1\" d=\"M15,0A15,15,0,1,0,30,15,15,15,0,0,0,15,0ZM11.83,21H9V12.52h2.82V21Zm-1.41-9.64h0a1.47,1.47,0,1,1,0-2.94A1.47,1.47,0,1,1,10.42,11.36ZM22,21H19.18V16.46c0-1.14-.41-1.92-1.43-1.92a1.56,1.56,0,0,0-1.45,1,2.1,2.1,0,0,0-.09.69V21H13.39s0-7.69,0-8.48h2.82v1.2a2.81,2.81,0,0,1,2.54-1.4c1.86,0,3.25,1.21,3.25,3.82V21Z\"> share-email\"> \" class=\"cls-1\" d=\"M15,0A15,15,0,1,0,30,15,15,15,0,0,0,15,0Zm9,21H6V10H24V21Zm-1-1.71v-7l-4,3ZM15,17l8-6H7Zm0.6,1H14.4l-2.57-2L7.71,20H22.29l-4.12-4ZM7,12.25v7l4-4Z\"> share-print\"> \" class=\"cls-1\" d=\"M10,8v3H20V8H10ZM8,12v6H9V17h1v5H20V17h1v1h1V12H8Zm2,2H9V13h1v1Zm9,7H11V20h8v1Zm0-2H11V18h8v1ZM8,12v6H9V17h1v5H20V17h1v1h1V12H8Zm2,2H9V13h1v1Zm9,7H11V20h8v1Zm0-2H11V18h8v1ZM10,8v3H20V8H10Zm0,0v3H20V8H10ZM8,12v6H9V17h1v5H20V17h1v1h1V12H8Zm2,2H9V13h1v1Zm9,7H11V20h8v1Zm0-2H11V18h8v1ZM8,12v6H9V17h1v5H20V17h1v1h1V12H8Zm2,2H9V13h1v1Zm9,7H11V20h8v1Zm0-2H11V18h8v1ZM20,8H10v3H20V8ZM15,0A15,15,0,1,0,30,15,15,15,0,0,0,15,0Zm8,19H21v4H9V19H7V11H9V7H21v4h2v8ZM8,18H9V17h1v5H20V17h1v1h1V12H8v6Zm3,0h8v1H11V18Zm0,2h8v1H11V20ZM9,13h1v1H9V13ZM20,8H10v3H20V8ZM10,8v3H20V8H10ZM8,12v6H9V17h1v5H20V17h1v1h1V12H8Zm2,2H9V13h1v1Zm9,7H11V20h8v1Zm0-2H11V18h8v1ZM8,12v6H9V17h1v5H20V17h1v1h1V12H8Zm2,2H9V13h1v1Zm9,7H11V20h8v1Zm0-2H11V18h8v1ZM10,8v3H20V8H10Z\"> SaveRemove",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4234497427/",
    "Applicants": "Burnaby, BC · 4 weeks ago · 48 people clicked apply\r\nResponses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Senior Software Application Developer (.net)",
    "CompanyName": "Fortinet",
    "ContactHiringSection": "",
    "Description": "About the job\r\nJob Description\r\n\r\nThe FortiCare team of the IT Department at Fortinet is looking for a Senior Software Applications Developer who is eager to work on multi-tier web applications, microservices, and the latest web client technologies. This team develops and supports multiple applications including product registration, order fulfillment, service contract/license management, service renewal, and a CRM support ticket application. The FortiCare systems are pure 3-tier web applications using MS .Net technologies and MS SQL Server as the backend database. The ideal candidate will have an opportunity to work alongside very experienced developers and enhance their software architecture and design skillset.\r\n\r\nJob Responsibilities\r\n\r\n Understand the company’s business processes for product entitlement/license management, product renewals, and customer support \r\n Understand system specifications and application high-level designs \r\n Complete application detail designs \r\n Apply a strong knowledge of Microsoft stack including C#, Web API 2 and SQL Server \r\n Cooperate with front-end developers in the process of creating RESTful APIs \r\n Participate in daily scrum meetings and take ownership of assigned stories \r\n\r\nJob Skills Required for Back-end C# Developer\r\n\r\n 7+ years of .Net web applications programming experience \r\n 7+ years SQL Server/T-SQL programming experience \r\n Understanding of web technologies like HTML5, CSS3, XML, JavaScript, AJAX, JSON, Web Service, etc. \r\n Understanding of OO design and commonly used web application programming patterns like MVC, etc. \r\n Understanding of application development methodologies and lifecycle management \r\n Knowledge of Microsoft Azure services such as App Service, Blob Storage, Azure SQL, Azure Functions, etc. is a plus \r\n\r\nThe Canada base salary range for this full-time position is expected to be between $80,000 - $125,000 annually. Wage ranges are based on various factors including the labour market, job type, and job level. Exact salary offers will be determined by factors such as the candidate’s subject knowledge, skill level, qualifications, and experience.\r\n\r\nFortinet strives to provide you and your family with a comprehensive benefits package. Benefits eligibility starts on your first day of hire and comprises of 100% company paid medical, dental, and vision coverage, including a Health Spending Account and a Personal Spending Account that gives you flexibility to spend where you need it the most. Our Employee & Family Assistance Plan (EFAP) offers you and your family access to various services like counseling, legal advice, mental health resources etc. We also provide critical illness, disability, and life insurance, as well as a Group Registered Retirement Savings Plan (RRSP) with a company match to help you save faster for retirement. We offer competitive Paid Time Off and flexible leave policies, including paid health days, to help you take care of yourself and your family members.\r\n\r\nAll roles are eligible to participate in the Fortinet equity program. Bonus eligibility is reviewed at time of hire and annually at the Company’s discretion.\r\n\r\nWhy Join Us:\r\n\r\nWe encourage candidates from all backgrounds and identities to apply. We offer a supportive work environment and a competitive Total Rewards package to support you with your overall health and financial well-being. Embark on a challenging, enjoyable, and rewarding career journey with Fortinet. Join us in bringing solutions that make a meaningful and lasting impact to our 660,000+ customers around the globe.\r\n\r\n#GD",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4104783577/",
    "Applicants": "Burnaby, BC · 6 months ago · 80 people clicked apply\r\nResponses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Senior Staff Full Stack Engineer (C#/React)",
    "CompanyName": "Motorola Solutions",
    "ContactHiringSection": "",
    "Description": "About the job\r\nCompany Overview\r\n\r\nAt Motorola Solutions, we believe that everything starts with our people. We’re a global close-knit community, united by the relentless pursuit to help keep people safer everywhere. Our critical communications, video security and command center technologies support public safety agencies and enterprises alike, enabling the coordination that’s critical for safer communities, safer schools, safer hospitals and safer businesses. Connect with a career that matters, and help us build a safer future.\r\n\r\nAperçu de l’entreprise\r\n\r\nChez Motorola Solutions, nous pensons que tout commence par nos employés. Nous sommes une communauté mondiale soudée, unie par la volonté incessante de contribuer à la sécurité des personnes partout dans le monde. Nos technologies de communication, de sécurité vidéo et de centre de commandement essentielles soutiennent les agences de sécurité publique et les entreprises, permettant une coordination essentielle pour des communautés, des écoles, des hôpitaux et des entreprises plus sécuritaires. Connectez-vous à une carrière qui compte et aidez-nous à bâtir un avenir plus sûr.\r\n\r\nDepartment Overview\r\n\r\nMotorola Solution’s Video Division is defining the future of the security industry through innovative end-to-end-solutions. We’re changing the landscape of the surveillance industry through advanced award-winning AI based surveillance systems. Artificial Intelligence is transforming the world and our team is advancing the field as it applies to the surveillance industry. We are proud to be industry leaders in video analytics with products like Appearance Search and Unusual Motion Detection along with our recently launched Avigilon cloud service platform. You will have the opportunity to contribute to intelligent camera surveillance systems through cutting edge research and software engineering.\r\n\r\nJob Description\r\n\r\nWe are seeking a Senior Staff Full Stack Engineer experienced in C# development within an Azure Cloud or Google Cloud Platform development environments that can provide hands on technical leadership in new product development and maintenance activities. The ideal candidate will have extensive experience delivering complex, large scale, public facing applications and APIs and have solid knowledge of DevOps, CI/CD and test automation tools and concepts.\r\n\r\nThis position is based in Vancouver, BC and the candidate must reside in the Greater Vancouver Area as you will be required to go into the office on a hybrid work schedule.\r\n\r\nWhy you'll love working here:\r\n\r\nContributing to a product deployed in high-stakes safety scenarios:\r\nSolving for safer: Protecting the well-being of people in a variety of situations and environments\r\nStreamlining communication and improving reactions to critical safety incidents\r\nSupporting the creation of more secure events and public assemblies (e.g., SportsNFL games, music concerts)\r\nCommitment to professional development & advancement:\r\nSupportive managers dedicated to understanding and fostering your growth\r\nWell-defined role, responsibilities, and expectations\r\n10% dedicated time for continuous learning and professional development (1 day every two weeks)\r\nGain experience solving different problems with different tech stacks:\r\nSolve critical problems based on camera analytics and AI\r\nDeveloping robust, large-scale APIs for both on-premise and cloud environments\r\nWork on rich UX to provide users with geospatial awareness and allow them to focus on critical items\r\nDiverse and inclusive team environment:\r\nOur teams prioritize creating a vibrant and welcoming culture\r\nGroups are designed to leverage a mix of opinions and personality types\r\nResponsibilities include:\r\n\r\nKey contributor within the Scrum team:\r\nPlaying a role in the team’s journey to high performance\r\nDeveloping on Avigilon Unity Video Products to be used by security professionals around the world\r\nBuilding trust among team members to champion a culture of continuous learning and growth\r\nParticipating in defining and executing t3he direction for build pipelines, containerization, DevOps tooling and test automation\r\nProviding end-to-end software solutions, encompassing design, architecture, implementation, testing, maintenance, and user support\r\nContributing to the realization of our architectural roadmap:\r\nActive participant in our Architecture community of practice\r\nEnsuring architectural vision is shared and implemented across teams\r\nLeveraging emerging technologies and tools to enhance our product and architectural capabilities\r\nConsistently Showing up with:\r\nEnergy and passion\r\nOptimistic outlook\r\nTransparent communication\r\nGrowth-oriented perspective\r\nGrowing and training our software organization:\r\nFostering strong collaborative relationships with fellow developers and technical leadership\r\nProactively providing technical guidance and mentorship\r\nUpholding rigorous standards for software development and quality, both personally and across the team\r\nQualifications:\r\n\r\nBachelor’s degree in Computer Science or related\r\n7+ years of experience as a Software Engineer\r\nExcellent written and oral communication skills\r\nExtensive experience in on-prem and cloud development in C#\r\nExperience delivering cloud solutions using different javascript frameworks (React, Angular, NodeJs)\r\n\r\nPreferred Qualifications:\r\n\r\nExperience leading teams as a technical lead\r\nSuccessful delivery of large scale public facing application\r\nStrong knowledge of CI/CD, test automation and DevOps\r\nExperience with AI/machine learning technologies is strongly preferred\r\n\r\nTarget Base Salary Range: $75,700 - 155,200 CAD\r\n\r\nConsistent with Motorola Solutions values and applicable law, we provide the following information to promote pay transparency and equity. Pay within this range varies and depends on job-related knowledge, skills, and experience. The actual offer will be based on the individual candidate.\r\n\r\nBasic Requirements\r\n\r\nBachelors Degree\r\n6+ years of experience in software development\r\n\r\nTravel Requirements\r\n\r\nUnder 10%\r\n\r\nRelocation Provided\r\n\r\nNone\r\n\r\nPosition Type\r\n\r\nExperienced\r\n\r\nReferral Payment Plan\r\n\r\nNo\r\n\r\nEEO Statement\r\n\r\nMotorola Solutions is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion or belief, sex, sexual orientation, gender identity, national origin, disability, veteran status or any other legally-protected characteristic.\r\n\r\nWe are proud of our people-first and community-focused culture, empowering every Motorolan to be their most authentic self and to do their best work to deliver on the promise of a safer world. If you’d like to join our team but feel that you don’t quite meet all of the preferred skills, we’d still love to hear why you think you’d be a great addition to our team.\r\n\r\nWe’re committed to providing an inclusive and accessible recruiting experience for candidates with disabilities, or other physical or mental health conditions. To request an accommodation, please complete this Reasonable Accommodations Form so we can assist you.\r\n\r\nMotorola Solutions adopte, favorise et promeut les principes de diversité, d’équité et d’inclusion. Nous encourageons et accueillons les candidatures de toutes les personnes qualifiées, quelles que soient leur race, origines ethnique, religion ou croyance, orientation sexuelle, identité et expression sexuelle, statut d’anciens combattants ou tout autre statut protégé par la Loi.\r\n\r\nNous sommes fiers de notre culture axée sur les personnes et les communautés, encourageant ainsi chaque Motorolan d’être la version la plus authentique de lui-même dans ses responsabilités afin de tenir la promesse d’un monde plus sécuritaire.\r\n\r\nSi vous souhaitez vous joindre à notre communauté mais croyez que vous ne possédez pas toutes les exigences requises pour le poste convoité, nous aimerions tout de même connaître les raisons pour lesquelles vous pensez être un excellent candidat pour notre équipe.\r\n\r\nNous offrons également des mesures d’adaptation pendant toutes les étapes du processus d’embauche afin de favoriser l’inclusion des personnes vivant avec un handicap physique et/ou mental. Pour demander un aménagement, veuillez remplir ce formulaire d'aménagement raisonnable afin que nous puissions vous aider.",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4242930313/",
    "Applicants": "Vancouver, BC · 2 weeks ago · 32 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Full Stack Software Developer II (C#/React)",
    "CompanyName": "Motorola Solutions",
    "ContactHiringSection": "",
    "Description": "About the job\r\nCompany Overview\r\n\r\nAt Motorola Solutions, we believe that everything starts with our people. We’re a global close-knit community, united by the relentless pursuit to help keep people safer everywhere. Our critical communications, video security and command center technologies support public safety agencies and enterprises alike, enabling the coordination that’s critical for safer communities, safer schools, safer hospitals and safer businesses. Connect with a career that matters, and help us build a safer future.\r\n\r\nAperçu de l’entreprise\r\n\r\nChez Motorola Solutions, nous pensons que tout commence par nos employés. Nous sommes une communauté mondiale soudée, unie par la volonté incessante de contribuer à la sécurité des personnes partout dans le monde. Nos technologies de communication, de sécurité vidéo et de centre de commandement essentielles soutiennent les agences de sécurité publique et les entreprises, permettant une coordination essentielle pour des communautés, des écoles, des hôpitaux et des entreprises plus sécuritaires. Connectez-vous à une carrière qui compte et aidez-nous à bâtir un avenir plus sûr.\r\n\r\nDepartment Overview\r\n\r\nMotorola Solution’s Video Division is defining the future of the security industry through innovative end-to-end-solutions. We’re changing the landscape of the surveillance industry through advanced award-winning AI based surveillance systems. Artificial Intelligence is transforming the world and our team is advancing the field as it applies to the surveillance industry. We are proud to be industry leaders in video analytics with products like Appearance Search and Unusual Motion Detection along with our recently launched Avigilon cloud service platform. You will have the opportunity to contribute to intelligent camera surveillance systems through cutting edge research and software engineering.\r\n\r\nJob Description\r\n\r\nWe are seeking an Intermediate Developer experienced in C#/.NET development as well as someone with experience in React or other modern JavaScript frameworks. The ideal candidate will have experience delivering complex, large scale, public facing applications and have solid knowledge of DevOps, CI/CD and test automation tools and concepts.\r\n\r\nWhy you'll love working here:\r\n\r\nContributing to a product deployed in high-stakes safety scenarios:\r\nSolving for safer: Protecting the well-being of people in a variety of situations and environments\r\nStreamlining communication and improving reactions to critical safety incidents\r\nSupporting the creation of more secure events and public assemblies (e.g., Sports games, music concerts)\r\nCommitment to professional development & advancement:\r\nSupportive managers dedicated to understanding and fostering your growth\r\nWell-defined role, responsibilities, and expectations\r\n10% dedicated time for continuous learning and professional development (1 day every two weeks)\r\nGain experience solving different problems with different tech stacks:\r\nSolve critical problems based on camera analytics and AI\r\nDeveloping robust, large-scale APIs for both on-premise and cloud environments\r\nWork on rich UX to provide users with geospatial awareness and allow them to focus on critical items\r\nDiverse and inclusive team environment:\r\nOur teams prioritize creating a vibrant and welcoming culture\r\nGroups are designed to leverage a mix of opinions and personality types\r\nResponsibilities include:\r\n\r\nContributing to the realization of our architectural roadmap:\r\nCreate cutting edge applications. The candidate should feel comfortable transitioning from back end, front end web projects along with desktop projects. \r\nRegardless of tech stack, candidate should be focused on usability, responsiveness, scalability, testability and best coding and design practices\r\nPeer review code for adherence to coding standards and design guidelines\r\nCollaborate with UX and visual designers on proposed designs\r\nOwn Quality: Write and maintain automation for the feature work your team works on\r\nConsistently Showing up with:\r\nEnergy and passion\r\nOptimistic outlook\r\nTransparent communication\r\nGrowth-oriented perspective\r\nGrowing and training our software organization:\r\nFostering strong collaborative relationships with fellow developers and technical leadership\r\nProactively providing technical guidance and mentorship\r\nUpholding rigorous standards for software development and quality, both personally and across the team\r\nKey contributor within the Scrum team:\r\nPlaying a role in the team’s journey to high performance\r\nDeveloping on Avigilon Unity Video Products to be used by security professionals around the world\r\nBuilding trust among team members to champion a culture of continuous learning and growth\r\nQualifications:\r\n\r\nBachelor’s degree in Computer Science or related\r\n3+ years of experience as a Software Engineer\r\nExcellent written and oral communication skills\r\nExperience in on-prem and cloud development in C#\r\nExperience delivering cloud solutions using different JavaScript frameworks (React, Angular, NodeJs)\r\n\r\nPreferred Qualifications:\r\n\r\nSuccessful delivery of large scale public facing application\r\nKnowledge of CI/CD, test automation and DevOps\r\nExperience with AI/machine learning technologies is strongly preferred\r\n\r\nThis position is based in Vancouver, BC and the candidate must reside in the Greater Vancouver Area as you will be required to go into the office on a hybrid work schedule.\r\n\r\nTarget Base Salary Range: $61,400 - $108,700 CAD\r\n\r\nConsistent with Motorola Solutions values and applicable law, we provide the following information to promote pay transparency and equity. Pay within this range varies and depends on job-related knowledge, skills, and experience. The actual offer will be based on the individual candidate.\r\n\r\nBasic Requirements\r\n\r\nBachelors Degree\r\n2+ years of software development experience\r\n\r\nTravel Requirements\r\n\r\nUnder 10%\r\n\r\nRelocation Provided\r\n\r\nNone\r\n\r\nPosition Type\r\n\r\nExperienced\r\n\r\nReferral Payment Plan\r\n\r\nNo\r\n\r\nEEO Statement\r\n\r\nMotorola Solutions is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion or belief, sex, sexual orientation, gender identity, national origin, disability, veteran status or any other legally-protected characteristic.\r\n\r\nWe are proud of our people-first and community-focused culture, empowering every Motorolan to be their most authentic self and to do their best work to deliver on the promise of a safer world. If you’d like to join our team but feel that you don’t quite meet all of the preferred skills, we’d still love to hear why you think you’d be a great addition to our team.\r\n\r\nWe’re committed to providing an inclusive and accessible recruiting experience for candidates with disabilities, or other physical or mental health conditions. To request an accommodation, please complete this Reasonable Accommodations Form so we can assist you.\r\n\r\nMotorola Solutions adopte, favorise et promeut les principes de diversité, d’équité et d’inclusion. Nous encourageons et accueillons les candidatures de toutes les personnes qualifiées, quelles que soient leur race, origines ethnique, religion ou croyance, orientation sexuelle, identité et expression sexuelle, statut d’anciens combattants ou tout autre statut protégé par la Loi.\r\n\r\nNous sommes fiers de notre culture axée sur les personnes et les communautés, encourageant ainsi chaque Motorolan d’être la version la plus authentique de lui-même dans ses responsabilités afin de tenir la promesse d’un monde plus sécuritaire.\r\n\r\nSi vous souhaitez vous joindre à notre communauté mais croyez que vous ne possédez pas toutes les exigences requises pour le poste convoité, nous aimerions tout de même connaître les raisons pour lesquelles vous pensez être un excellent candidat pour notre équipe.\r\n\r\nNous offrons également des mesures d’adaptation pendant toutes les étapes du processus d’embauche afin de favoriser l’inclusion des personnes vivant avec un handicap physique et/ou mental. Pour demander un aménagement, veuillez remplir ce formulaire d'aménagement raisonnable afin que nous puissions vous aider.",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4238490487/",
    "Applicants": "Vancouver, BC · 2 weeks ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Senior .Net Full Stack Dev Lead",
    "CompanyName": "Infosys",
    "ContactHiringSection": "",
    "Description": "About the job\r\nJob Description\r\n\r\nInfosys is seeking a Senior .net full stack dev lead who will play a key role for design, development, and end to end support for a development enhancement program with for one of the key clients.\r\n\r\nRequired Qualifications\r\n\r\nCandidate must be located within commuting distance of Burnaby or be willing to relocate to the area. This position may require travel.\r\n\r\nBachelor’s degree or foreign equivalent required from an accredited institution. Will also consider three years of progressive experience in the specialty in lieu of every year of education.\r\n\r\nAt least 4 years of Information Technology experience.\r\n\r\nCandidates authorized to work for any employer in Canada without employer-based visa sponsorship are welcome to apply. Infosys is unable to provide immigration sponsorship for this role at this time.\r\n\r\nPreferred Skills\r\n\r\n Drive the end-to-end software development lifecycle, from requirements gathering and system design to implementation, testing, deployment, and maintenance.\r\n Full stack developer with good experience in design, development, testing and deployment of applications.\r\n Must have at least 5 years of Experience working in ASP .NET, .NET Core, C#, Generics, Delegates, Events\r\n Excellent in OOPs, SOLID Design principles and SDLC\r\n Excellent Problem Solving Analytical and Debugging Skills.\r\n Real experience working in N-Tier complex projects – web applications.\r\n Experience in Agile SCRUM Methodology\r\n Must have experience in Web Services – WCF, REST, Web APIs, ADO.NET\r\n Must have experience in Azure – Azure Managed Identity, Service Bus, App Services, Function Apps, WebApps\r\n Must have experience in developing UT framework Like Nunit, MSTest, Xunit\r\n Must have experience in team handling, managing quality for team deliverables.\r\n\r\nPreferred Qualifications\r\n\r\n Knowledge of Migration to .Net Core.\r\n Knowledge of SQL coding guidelines, best practices etc.\r\n Knowledge of CICD toolset: VSO/TFS\r\n On the Job Experience in Code Reviews using Visual Studio, Code Flow etc.\r\n Understanding of Metadata -Driven Development models, Multitenant Architecture.\r\n SQL Programming and Profiling/Optimization\r\n Power BI based development\r\n Logging and Telemetry\r\n Issue identification and Resolution\r\n Self-motivated and competent to work independently in complex environment.\r\n\r\nThe job may also entail sitting as well as working at a computer for extended periods of time. Candidates should be able to effectively communicate by telephone, email, and face to face.\r\n\r\nEstimated annual compensation range for the candidate based in the below location will be: BC-$81575 to $116670",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4234493090/",
    "Applicants": "Burnaby, BC · Reposted 1 week ago · 88 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Senior Software Engineer",
    "CompanyName": "PressReader",
    "ContactHiringSection": "",
    "Description": "About the job\r\nPressReader is a rapidly growing technology company that partners with the world's leading publishers to deliver content to millions of users in over 160 countries. Our progressive approach to digital distribution has allowed publishers such as The Washington Post, The Guardian, Newsweek, Rolling Stone, The Globe and Mail, and Vogue to find new audiences through business partnerships, including airlines, hotels, cruise ships, libraries, and thousands of other companies worldwide.\r\n\r\nOur technology also powers Branded Editions (BE) - a white-label solution that enables publishers to deliver their digital content in interactive ways. BE allows them to build a customizable platform that supports a wide range of revenue opportunities.\r\n\r\nWe have a full-time opportunity for a Senior Software Engineer to join our Engineering Team.\r\n\r\nAs part of the Engineering team, you will work on an award-winning digital platform, and work across various stages of the software development cycle in a wide range of development projects. You will use your proven experience in .NET to heighten our current and future projects. You will help shape the culture and success of our Engineering department.\r\n\r\nThis is a great opportunity for a developer who has about 5+ years of experience working with .NET applications as part of a professional team. Solid experience with C# and SQL is essential.\r\n\r\nIn this role, you will:\r\n\r\nDesign and develop key software components and services for PressReader applications, primarily focusing on the backend, but also contributing to the frontend as needed\r\nDeliver code with top-tier quality while adhering to development best practices, employing test-driven development methodologies, and supporting test automation\r\nEngage in estimating project efforts and timelines for delivery\r\nTake charge in conducting peer design and code reviews\r\nIdentify technical, schedule, and other potential project risks, providing pertinent feedback\r\nActively collaborate with teammates and maintain effective communication with project stakeholders to ensure smooth and predictable project progression\r\nCreate and uphold high-caliber technical documentation outlining software designs and solutions\r\nCoach and/or mentor junior engineers on the team\r\n\r\n\r\nYou may be a great fit if you have:\r\n\r\nMinimum of 5 years' experience in developing .NET applications\r\nProficient in crafting reliable and scalable software systems\r\nMastery in building backend services using C# and SQL. \r\nProven experience in constructing micro-services utilizing Docker/Kubernetes\r\nProficiency in refactoring complex code to enhance testability and maintainability\r\nKnowledge or experience in test-driven development and agile/iterative development methodologies\r\nExceptional communication skills, both written and verbal, coupled with strong interpersonal abilities\r\nA team-player mindset with a willingness to broaden skills and actively contribute ideas and knowledge\r\n\r\n\r\n Bonus points if you:\r\n\r\nHave experience with a modern front-end development framework (Angular, React, or Vue.js)\r\nHold a Bachelor's Degree in Computer Science\r\n\r\nWhy us for your next career adventure? \r\n\r\nPressReader offers a hybrid work environment to balance the flexibility of working from home and being together to collaborate, celebrate, and connect. This position is based in our Richmond, BC office and requires to be on-premises three days a week. When not in the office, employees have the opportunity to work remotely.\r\n\r\nPressReader is committed to providing a fair compensation package which include a 100% employer-paid health, dental, and vision benefit plan; 15 paid vacation days to start; health and wellness days and bereavement days; reimbursements for professional training and membership in professional associations; fitness subsidy and more, along with a chance to be working with amazing people. The pay range for this role is $110,000 to $130,000, depending on experience.\r\n\r\nWe thank everyone who is interested in our role. Only qualified candidates legally eligible to work in Canada will be directly contacted for this position.\r\n\r\nIf you don't see yourself fully reflected in every job requirement listed for this job, we still encourage you to apply. We are committed to creating a more equitable, inclusive and diverse company and we welcome applicants of all genders, ages, ethnicities, cultures, abilities, sexual orientations, sexual identification, and life experiences. If you require accommodation in completing any pre-employment assessments or applications, interviewing, or otherwise participating in the recruitment process, please email people@pressreader.com.\r\n\r\nFinally, sometimes emergencies happen and you may need to reschedule an interview. We understand. Please let us know without worrying about losing the opportunity or your credibility.\r\n\r\nTo apply, please submit your resume, and a cover letter explaining why you are the right person for this role.\r\n\r\nThis is a great opportunity for the right candidate.\r\n\r\nWe can't wait to meet you!",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4229315740/",
    "Applicants": "Richmond, BC · 2 months ago · 26 applicants\r\nNo response insights available yet",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Senior Software Engineer(.Net)",
    "CompanyName": "Comm100",
    "ContactHiringSection": "",
    "Description": "About the job\r\nApply Now: Senior Software Engineer(.Net)\r\n\r\nWho We Are \r\nComm100 is an award-winning digital customer engagement platform, enabling organizations to better engage, convert and support their customers online. Established in 2009, Comm100 serves over 10,000 clients globally including HP, Rackspace, Government of Canada, Google, Stanford University, and many more. We believe that our work is never done as long as there are customers in a queue. We don’t sleep until we find the smartest, most efficient way to communicate, answer questions, and solve problems. \r\n\r\nWhat We Believe \r\nAt Comm100, we strongly believe that the success of a company depends entirely on its people. We seek self-motivated team players who will appreciate a performance-driven work environment, rooted in creativity, personal development, integrity and open communication. We work hard but always make time for fun. \r\n What We Offer \r\nCompetitive compensation\r\nComprehensive benefits package \r\nFlexible working environment and office hours \r\nQuarterly fun and interactive team-building events \r\nOpportunities for professional learning, growth, and career advancement \r\n\r\nAbout the Role\r\nJob Responsibilities: \r\n Design, build, and maintain backend APIs or Services based on the customer requirements and software specifications. \r\n Writing clean, high-quality, high-performance, maintainable code with company common frameworks/libraries. \r\n Document and illustrate solutions with clear code, diagrams, and documentation. \r\n Writing clean, readable, and thoroughly tested code to ensure software reliability and maintainability. \r\n Safeguard operations with secure coding practices and confidentiality. \r\n Work closely with cross-regional engineering teams to facilitate communication and collaboration. \r\n Support and mentor fellow engineers, providing guidance, coaching, and educational opportunities. \r\n Engage in direct communication with customers and business stakeholders to propose technical solutions and address product issues. \r\n Stay updated with the latest development tools and techniques, while expanding your knowledge through education, publications, and networking. \r\n\r\n Job Requirements: \r\n Bachelor’s degree or above in computer science or software engineering. \r\n 5+ years of hands-on experience in application development. \r\n Proficient in C#, .Net Core, C#, ASP.NET Core, Entity framework and visual studio IDE. \r\n Proficient in SQL Server Database, including database design, database management and SQL statements analysis and performance tuning. \r\n In-depth knowledge of Object-Oriented Design and design principles like Domain Driven Design. \r\n Familiarity with DevOps practices and CI/CD pipelines. \r\n Possesses a curious mindset, a passion for continuous learning, and strong problem-solving abilities. \r\n Good communication skills and teamwork spirit. \r\n Passion in software development, new techniques, and the ability to provide technical guidance to team members. \r\n Experience with large-scale, high concurrency web applications development is a strong plus. \r\n\r\nSalary: $80,000 – 120,000 per year\r\n Location: This position is a fully on-site role.\r\n\r\nWe sincerely thank all applicants for their interest; however, only shortlisted candidates will be contacted. Applicants must be eligible to work in Canada.",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4223264167/",
    "Applicants": "Vancouver, BC · 1 month ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Développeur .Net",
    "CompanyName": "DELAN - Chasseurs de Talents en TI",
    "ContactHiringSection": "",
    "Description": "About the job\r\nNous sommes présentement à la recherche d’un Développeur .Net Core Fullstack afin d’effectuer de la modernisation logicielle.\r\n\r\n\r\nPLUS PRÉCISÉMENT\r\n\r\n• Participer à la conception, au développement et à la maintenance d'applications de haute qualité.\r\n• Effectuer la passation de technologies désuètes vers un stack technologique récent.\r\n• Optimiser, moderniser et maintenir les applications actuelles\r\n• Collaborer avec des équipes multidisciplinaires pour définir, concevoir et déployer de nouvelles fonctionnalités.\r\n\r\n\r\nPROFIL\r\n\r\n• 8+ années d’expérience en développement Full Stack\r\n• Expérience professionnelle en développement back-end (C#, .NET)\r\n• Maitrise des technologies Front-end suivantes : HTML, CSS, JavaScript, React/Vue/Angular\r\n• Familiarité avec les bases de données (SQL) et la conception d'API.\r\n• BAC en informatique ou l’équivalent\r\n• Anglais requis\r\n\r\n______________\r\n\r\n\r\nWe are currently looking for a Full Stack .Net Core Developer to work on software modernization.\r\n\r\n\r\nMORE SPECIFICALLY\r\n\r\n• Participate in the design, development, and maintenance of high-quality applications.\r\n• Migrate outdated technologies to a modern tech stack.\r\n• Optimize, modernize, and maintain existing applications.\r\n• Collaborate with multidisciplinary teams to define, design, and deploy new features.\r\n\r\n\r\nPROFILE\r\n\r\n• 8+ years of experience in Full Stack development.\r\n• Professional experience in back-end development (C#, .NET).\r\n• Proficiency in front-end technologies: HTML, CSS, JavaScript, React/Vue/Angular.\r\n• Familiarity with databases (SQL) and API design.\r\n• Bachelor’s degree in computer science or equivalent.\r\n• English required.\r\n\r\n______________\r\n\r\n\r\n🆕 www.delan.qc.ca\r\nDécouvrez +50 autres offres d’emplois en TI\r\nDiscover +50 other IT jobs\r\n\r\n______________\r\n\r\n💻 www.linkedin.com/company/DelanTI\r\nSuivez-nous sur LinkedIn\r\nFollow us on LinkedIn\r\n\r\n______________",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4252386506/",
    "Applicants": "Vancouver, BC · 1 day ago · 27 applicants\r\nPromoted by hirer · No response insights available yet",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Software Engineer (C#) - Tools & Technology",
    "CompanyName": "Electronic Arts (EA)",
    "ContactHiringSection": "",
    "Description": "About the job\r\nDescription & Requirements\r\n\r\nElectronic Arts creates next-level entertainment experiences that inspire players and fans around the world. Here, everyone is part of the story. Part of a community that connects across the globe. A place where creativity thrives, new perspectives are invited, and ideas matter. A team where everyone makes play happen.\r\n\r\nThe Challenge Ahead\r\n\r\nAs a Software Engineer within the Tools & Technology team, you will support the interoperability of EA's central technology group by working on tools that help our partner game studios to deliver AAA games. You will partner with a Product Owner and Technical Leads alongside a talented development team, while reporting to a team Development Director.\r\n\r\nDay-to-day, You Will\r\n\r\nCreate software solutions in tools, pipelines, and workflow development.\r\nPartner with our end-users to gather requirements and design, implement, debug, test, and maintain quality code.\r\nWork with our development team to deliver iterations and features.\r\nOptimize codebases and workflows, improving coding standards.\r\nCollaborate with QA to enhance unit testing workflows.\r\n\r\nYou Are/you Have\r\n\r\n6+ years in content creation tools and software workflow improvements.\r\nBachelor's degree or equivalent experience in software development.\r\nProficiency in C#, unit testing (XUnit, NUnit), and build systems (GitLab Workflows, NANT, MSBuild).\r\nExperience with REST API, OpenApi, ASP.NET Core, and web development (React, Angular, Vue.js).\r\nExperience in content creation pipelines.\r\n\r\nBonus If You Have\r\n\r\nPython or C++ knowledge.\r\nExperience with Source Code Control Systems (TFS, Perforce, SVN, GIT).\r\nFamiliarity with MongoDB, gRPC networking, Agile methodologies, and UI development.\r\nBackground in tool development for procedural content, character editing, and art pipelines.\r\n\r\nCompensation And Benefits\r\n\r\nThe ranges listed below are what EA in good faith expects to pay applicants for this role in these locations at the time of this posting. If you reside in a different location, a recruiter will advise on the applicable range and benefits. Pay offered will be determined based on a number of relevant business and candidate factors (e.g. education, qualifications, certifications, experience, skills, geographic location, or business needs).\r\n\r\nPAY RANGES\r\n\r\n British Columbia (depending on location e.g. Vancouver vs. Victoria) * $115,100 - $161,200 CAD\r\n\r\nIn British Columbia, we offer a package of benefits including vacation (3 weeks per year to start), 10 days per year of sick time, paid top-up to EI/QPIP benefits up to 100% of base salary when you welcome a new child (12 weeks for maternity, and 4 weeks for parental/adoption leave), extended health/dental/vision coverage, life insurance, disability insurance, retirement plan to regular full-time employees. Certain roles may also be eligible for bonus and equity.\r\n\r\nAbout Electronic Arts\r\n\r\nWe’re proud to have an extensive portfolio of games and experiences, locations around the world, and opportunities across EA. We value adaptability, resilience, creativity, and curiosity. From leadership that brings out your potential, to creating space for learning and experimenting, we empower you to do great work and pursue opportunities for growth.\r\n\r\nWe adopt a holistic approach to our benefits programs, emphasizing physical, emotional, financial, career, and community wellness to support a balanced life. Our packages are tailored to meet local needs and may include healthcare coverage, mental well-being support, retirement savings, paid time off, family leaves, complimentary games, and more. We nurture environments where our teams can always bring their best to what they do.\r\n\r\nElectronic Arts is an equal opportunity employer. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. We will also consider employment qualified applicants with criminal records in accordance with applicable law. EA also makes workplace accommodations for qualified individuals with disabilities as required by applicable law.",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4232855441/",
    "Applicants": "Vancouver, BC · Reposted 1 week ago · 88 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Software Engineer(.Net)",
    "CompanyName": "Comm100",
    "ContactHiringSection": "",
    "Description": "About the job\r\nApply Now: Software Engineer(.Net)\r\n\r\nWho We Are\r\n\r\nComm100 is an award-winning digital customer engagement platform, enabling organizations to better engage, convert and support their customers online. Established in 2009, Comm100 serves over 10,000 clients globally including HP, Rackspace, Government of Canada, Google, Stanford University, and many more. We believe that our work is never done as long as there are customers in a queue. We don’t sleep until we find the smartest, most efficient way to communicate, answer questions, and solve problems.\r\n\r\nWhat We Believe\r\n\r\nAt Comm100, we strongly believe that the success of a company depends entirely on its people. We seek self-motivated team players who will appreciate a performance-driven work environment, rooted in creativity, personal development, integrity and open communication. We work hard but always make time for fun.\r\n\r\nWhat We Offer\r\n\r\nCompetitive compensation\r\nComprehensive benefits package \r\nFlexible working environment and office hours \r\nQuarterly fun and interactive team-building events \r\nOpportunities for professional learning, growth, and career advancement \r\n\r\nAbout The Role\r\n\r\nJob Responsibilities: \r\n\r\nDesign, build, and maintain backend APIs or Services based on the customer requirements and software specifications. \r\nWriting clean, high-quality, high-performance, maintainable code with company common frameworks/libraries. \r\nDocument and illustrate solutions with clear code, diagrams, and documentation. \r\nWriting clean, readable, and thoroughly tested code to ensure software reliability and maintainability. \r\nSafeguard operations with secure coding practices and confidentiality. \r\nWork closely with cross-regional engineering teams to facilitate communication and collaboration. \r\nEngage in direct communication with customers and business stakeholders to propose technical solutions and address product issues. \r\nStay updated with the latest development tools and techniques, while expanding your knowledge through education, publications, and networking. \r\n\r\nJob Requirements\r\n\r\nBachelor’s degree or above in computer science or software engineering. \r\n2+ years of hands-on experience in application development. \r\nProficient in C#, .Net Core, C#, ASP.NET Core, Entity framework and visual studio IDE. \r\nFamiliar with SQL Server Database, including database design, database management and SQL statements analysis and performance tuning. \r\nKnowledge of Object-Oriented Design and design principles like Domain Driven Design. \r\nPossesses a curious mindset, a passion for continuous learning, and good problem-solving abilities. \r\nGood communication skills and teamwork spirit. \r\nExperience with Frontend development with React, Vue, or AngularJS is a strong plus. \r\n\r\nSalary: $60,000 – 100,000 per year\r\n\r\nLocation: This position is a fully on-site role.\r\n\r\nWe sincerely thank all applicants for their interest; however, only shortlisted candidates will be contacted. Applicants must be eligible to work in Canada.",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4224847408/",
    "Applicants": "Vancouver, BC · 1 month ago · 90 people clicked apply\r\nResponses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Full Stack Software Engineer",
    "CompanyName": "Maximizer",
    "ContactHiringSection": "",
    "Description": "About the job\r\nAt Maximizer, we strongly believe that the success of a company depends entirely on its people. We seek self-motivated team players who appreciate a performance-driven work environment rooted in creativity, professional development, integrity, and open communication. \r\n\r\nAbout the Role: \r\nWe are looking for a results-driven Full Stack Software Engineer who thrives on solving complex problems and creating meaningful impact within a growing organization. You will work across our tech stack, contributing to both the frontend and backend of our platform. \r\nOur current stack includes Angular + TypeScript, C#, .NET, and Azure cloud infrastructure.  \r\n\r\nWhat you’ll do: \r\nDevelop new features and capabilities across our platform. \r\nRefactor, modernize, and migrate legacy code. \r\nTake full ownership and responsibility for your solutions and technical decisions. \r\nLead and contribute to key cross-team technical projects and initiatives. \r\nCollaborate with product managers, designers, and fellow engineers to deliver high-quality solutions. \r\n\r\nWho you are: \r\nDeeply curious: you operate with a sense of urgency and always look for new ways to understand our customers and create value on their behalf. \r\nData-fluent: you use data to solve problems, identify opportunities, and are capable of inventing and using new metrics in order to learn and make decisions. \r\nBiased for action: you make good decisions with incomplete data and are constantly optimizing for learning. We shift fast to learn fast. Every day we move the needle. \r\nTechnically progressive: You stay current with industry trends and continuously drive innovation. \r\n\r\nWhat you’ll bring: \r\n4+ years of software development experience. \r\n2+ years of software development experience in C#, .NET and Azure technologies. \r\nProficiency with TypeScript and at least one modern frontend framework (Angular preferred; React or Vue also acceptable). \r\nStrong debugging and problem-solving skills. \r\nA mindset for end-to-end ownership of features and services. \r\nProven ability to work independently and proactively. \r\nExcellent communication and cross-functional collaboration skills. \r\nThe initiative to fix something that's broken, rather than waiting for someone else to do it. \r\n \r\nWhy you should apply: \r\n💰 Competitive Salaries with RRSP matching \r\n🏝 Generous paid vacay and sick days \r\n💻 A powerful Laptop \r\n📚 Budget for courses, books, and personal development \r\n❤️ Peer to peer recognition and rewards \r\n🍹 Team building events, happy hours and more \r\n🧒🏻 Flexible, remote & hybrid work \r\n\r\nAbout Maximizer: \r\nMaximizer was founded in a garage on Vancouver Island, Canada, in 1987 — born out of a vision to help businesses better manage and grow their customer relationships. From our early innovations in contact management systems (CMS) and sales force automation (SFA), to today’s sophisticated customer relationship management (CRM) solutions, we’ve been at the forefront of the industry for over three decades. \r\n\r\nOver the years, Maximizer has proudly served more than 100,000 customers and supported over 1 million users worldwide — with a strong footprint across industries, particularly among financial services firms, financial advisors, and wealth management professionals who trust Maximizer to help them grow and retain client relationships. \r\n\r\nToday, we remain one of the few CRM providers globally offering full deployment flexibility — on-premise, private cloud, or shared cloud — with seamless access via desktop, mobile device, or our Maximizer mobile app. \r\n\r\nAs a proudly Canadian company, we are committed to helping businesses of all sizes achieve three critical goals: \r\nWin new customers \r\nBuild long-term loyalty \r\nMaximize the value of every client relationship \r\n\r\nAt Maximizer, we don’t just deliver software — we deliver results, backed by over 30 years of experience in empowering organizations to grow smarter, faster, and stronger. \r\n\r\nInterested? We’d love to hear from you!  \r\nIf you’re a driven, results-oriented marketer with a passion for CRM, financial services, fintech, and the energy of a start-up or scale-up environment, we want to hear from you! \r\nMaximizer CRM is committed to diversity and inclusion. We encourage all qualified individuals to apply, regardless of gender, race, religion, sexual orientation, or disability. We thank all applicants for their interest, however, only those selected for an interview will be contacted.",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4250559505/",
    "Applicants": "Vancouver, BC · 3 days ago · Over 100 applicants\r\nPromoted by hirer · Actively reviewing applicants",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Senior Software Developer",
    "CompanyName": "Cymax Group Technologies",
    "ContactHiringSection": "",
    "Description": "About the job\r\nWho We Are\r\n\r\nCymax Group Technologies is a leading eCommerce technology and logistics services platform for big & bulky vendors and retailers. We maximize the best of technology, automation, and AI to simplify the complexities of eCommerce through our two products - Channel Gate and Freight Club. We partner with vendors and retailers to tackle some of the industry’s biggest challenges, offering prescriptive recommendations to optimize their ROI in a competitive market. Our remote-flexible team works to support our partners from the US and Canada.\r\n\r\nThe Role \r\n\r\nWe are seeking a highly skilled and experienced Senior Software Developer to join our team. The ideal candidates will have 5 to 7 years of experience in software development with extensive knowledge and hands-on experience with Azure, including Azure DevOps pipeline creation, along with strong experience in unit testing, integration testing, SQL tuning, .NET framework, and .NET. Additionally, proficiency in a front-end JavaScript framework or library like Angular or React is required.\r\n\r\nIn this role, you’ll build and deliver internal services software that will be used by people throughout the business to support users in accessing information as efficiently as possible. You will use your deep technical knowledge in web application development to create interfaces and tools that are user-friendly and add value to the way we work. You’ll work closely with the Technical Project Manager and the Development team on what you build, and will also partner with users across the organization to ensure the end product meets a broad range of needs.\r\n\r\nThis is a hybrid role, based in the Vancouver, BC area. The ideal candidate will work 1 to 2 days in the Vancouver office, with the flexibility to work remotely for the remainder of the week.\r\n\r\nWhat You’ll Do\r\n\r\nDesign, develop, and maintain robust and scalable applications using .NET Framework.\r\nBuild and manage Azure DevOps pipelines for continuous integration and continuous deployment (CI/CD).\r\nConduct thorough unit testing and integration testing to ensure the quality and functionality of the software.\r\nOptimize SQL databases and perform database tuning to enhance performance and reliability.\r\nDevelop and maintain front-end components using Angular or React.\r\nCollaborate with cross-functional teams to define, design, and ship new features.\r\nTroubleshoot and resolve complex technical issues.\r\nStay updated with the latest industry trends and technologies to ensure our solutions remain cutting-edge, with a focus on new and emerging AI services and trends.\r\nWork closely with the Project and Development team to align on project goals and deliverables.\r\nEngage with users across the organization to gather requirements and feedback, ensuring the developed solutions meet their needs.\r\n\r\nWho You Are\r\n\r\nExtensive experience with Azure services.\r\nStrong expertise in unit testing and integration testing.\r\nProficiency in SQL and experience with database tuning and optimization.\r\nIn-depth knowledge of .NET Framework, .NET Core, and Entity Framework.\r\nHands-on experience with front-end development using Angular or React.\r\nExperience with AI tools like Copilot and generative AI models like ChatGPT or DALL-E.\r\nPrior experience in the e-commerce and logistics domain is a significant plus.\r\nExcellent problem-solving skills and attention to detail.\r\nStrong communication and teamwork abilities.\r\nBachelor's degree in Computer Science, Engineering, or a related field.\r\n\r\nNice to Have \r\n\r\nExperience with other JavaScript frameworks or libraries such as Vue, Angular, or React.\r\nFamiliarity with other cloud platforms and services.\r\nExperience and interest in using AI models, services, and tools to augment development.\r\n\r\nCulture at Cymax Group\r\n\r\nAt our company, we thrive on innovation and entrepreneurship. Our fast-paced environment encourages agility and nimbleness, empowering our team to adapt quickly to changing market dynamics. We’re passionate about learning and growth, providing opportunities for professional development. Our decisions are driven by data, ensuring that we make informed choices that lead to success. If you’re excited about making an impact and being part of a dynamic team, you’ll feel right at home here.\r\n\r\nOur Values\r\n\r\nOur core values are the compass that guides our actions, unites our team, and shapes the future of our company:\r\n\r\nGrit & Agility: Forge Ahead, Pivot Fast\r\nAccountability: Bring It, Own It, Commit\r\nGo the Extra Mile: We Go Above & Beyond\r\nUnderstand the Map & the Terrain: Master the Details & the Big Picture\r\nData Drives Decisions: Absorb Complexity & Transmit Clarity\r\nThink Beyond Today: Tomorrow's Vision, Today's Action\r\n\r\nCompensation\r\n\r\nThe Salary Range for this role is between $100,000 and $130,000, depending on experience. Our salary ranges are determined by role, level and location. We offer a comprehensive range of benefits which includes:\r\n\r\nHealth and wellness support for our team members and their families including an employee assistance program\r\n100% paid premiums for health and dental benefits in Canada\r\nPaid time off\r\nEasy access to online and phone-based counselling services\r\nAnd a remote-flexible work environment.\r\n\r\nJoin Our AI Journey at Cymax Group!\r\n\r\nAt Cymax Group, we thrive on innovation and entrepreneurship. As an AI-first organization, we are on an exciting journey to continuously grow and evolve our focus on AI, empowering our people at all levels. Our fast-paced environment encourages agility and nimbleness, enabling our team to adapt swiftly to changing market dynamics. We're passionate about continuous learning and growth, offering opportunities for professional development. Our data-driven decision-making ensures we make informed choices that lead to success. If you're excited about making an impact and being part of a dynamic, AI-empowered team, you'll feel right at home here.\r\n\r\nJoin us and be part of a dynamic team that values innovation, collaboration, and excellence. Apply now to make a significant impact at Cymax Group Technologies and Freight Club!\r\n\r\nAccessibility\r\n\r\nWe can provide accessibility accommodations during the recruitment process. Should you require any accommodation, please let us know and we will work with you to meet your needs.",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4224065223/",
    "Applicants": "Vancouver, BC · Reposted 2 days ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Intermediate Software Developer",
    "CompanyName": "Cymax Group Technologies",
    "ContactHiringSection": "",
    "Description": "About the job\r\nWho We Are\r\n\r\nCymax Group Technologies is a leading eCommerce technology and logistics services platform for big & bulky vendors and retailers. We maximize the best of technology, automation, and AI to simplify the complexities of eCommerce through our two products - Channel Gate and Freight Club. We partner with vendors and retailers to tackle some of the industry’s biggest challenges, offering prescriptive recommendations to optimize their ROI in a competitive market. Our remote-flexible team works to support our partners from the US and Canada.\r\n\r\nThe Role\r\n\r\nWe are seeking a motivated and skilled Software Developer to join our team. The ideal candidate will have a strong foundation in Azure, .NET technologies, SQL, and front-end development using Angular or React. This role will involve participation in the design, code review, and implementation of new product features, as well as assisting in diagnosing and troubleshooting issues.\r\n\r\nThis is a hybrid role, based in the Vancouver, BC area. The ideal candidate will work 1 to 2 days in the Vancouver office, with the flexibility to work remotely for the remainder of the week.\r\n\r\nYour Responsibilities\r\n\r\nParticipate in the design, code review, and implementation of new product features.\r\nAssist in diagnosing, troubleshooting, and solving incidents, bugs, and problems with the product.\r\nWrite efficient, reusable, and reliable code following best practices and coding standards.\r\nMaintain version control using Git and ensure effective branch management strategies.\r\nOptimize application performance and scalability.\r\nDesign and implement database schemas, queries, and stored procedures in SQL Server.\r\nDeploy applications to Azure cloud services and manage resources effectively.\r\nStay updated with the latest technologies, trends, and best practices in software development.\r\n\r\nYou Bring \r\n\r\nExperienced in web application development utilizing C#, .NET, ASP.NET MVC/Core, and SQL Server.\r\nExperience with web services and REST API.\r\nUnderstanding of object-oriented design patterns.\r\nExperience with Test-Driven Development (TDD) is an asset.\r\nUnderstanding of JavaScript and CSS.\r\nExperience in an Agile/SCRUM development environment.\r\nExperience with Azure, Web Jobs SDK, Azure Functions.\r\nKnowledgeable in using Git and related tools like GitHub, GitLab, etc.\r\n3+ years of professional experience in software development using .NET technologies.\r\nExperience with AI tools like Copilot and generative AI models like ChatGPT or DALL-E.\r\nExperience with modern front-end libraries/frameworks like Angular or React is an asset.\r\n\r\nCulture at Cymax Group\r\n\r\nAt our company, we thrive on innovation and entrepreneurship. Our fast-paced environment encourages agility and nimbleness, empowering our team to adapt quickly to changing market dynamics. We’re passionate about learning and growth, providing opportunities for professional development. Our decisions are driven by data, ensuring that we make informed choices that lead to success. If you’re excited about making an impact and being part of a dynamic team, you’ll feel right at home here.\r\n\r\nOur Values\r\n\r\nOur core values are the compass that guides our actions, unites our team, and shapes the future of our company:\r\n\r\nGrit & Agility: Forge Ahead, Pivot Fast\r\nAccountability: Bring It, Own It, Commit\r\nGo the Extra Mile: We Go Above & Beyond\r\nUnderstand the Map & the Terrain: Master the Details & the Big Picture\r\nData Drives Decisions: Absorb Complexity & Transmit Clarity\r\nThink Beyond Today: Tomorrow's Vision, Today's Action\r\n\r\nCompensation\r\n\r\nThe Salary Range for this role is between $80,000 and $100,000, depending on experience. Our salary ranges are determined by role, level and location. We offer a comprehensive range of benefits which includes:\r\n\r\nHealth and wellness support for our team members and their families including an employee assistance program\r\n100% paid premiums for health and dental benefits in Canada\r\nPaid time off\r\nEasy access to online and phone-based counselling services\r\nAnd a remote-flexible work environment.\r\n\r\nJoin Our AI Journey at Cymax Group!\r\n\r\nAt Cymax Group, we thrive on innovation and entrepreneurship. As an AI-first organization, we are on an exciting journey to continuously grow and evolve our focus on AI, empowering our people at all levels. Our fast-paced environment encourages agility and nimbleness, enabling our team to adapt swiftly to changing market dynamics. We're passionate about continuous learning and growth, offering opportunities for professional development. Our data-driven decision-making ensures we make informed choices that lead to success. If you're excited about making an impact and being part of a dynamic, AI-empowered team, you'll feel right at home here.\r\n\r\nJoin us and be part of a dynamic team that values innovation, collaboration, and excellence. Apply now to make a significant impact at Cymax Group Technologies and Freight Club!\r\n\r\nAccessibility\r\n\r\nWe can provide accessibility accommodations during the recruitment process. Should you require any accommodation, please let us know and we will work with you to meet your needs.",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4224064245/",
    "Applicants": "Vancouver, BC · Reposted 1 day ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Senior Software Development Leader (Manager)",
    "CompanyName": "MatchBox Consulting Group",
    "ContactHiringSection": "",
    "Description": "About the job\r\nMatchBox Consulting Group is currently seeking a Senior Software Development Leader (Manager) for a permanent role with a client of ours located in Vancouver (Hybrid set-up-3 days per week on-site and 2 days remote).\r\n\r\nWhat can you expect in this role?\r\n\r\nThe Senior Software Development Leader is responsible for providing technical direction and the management of development staff. Reporting to the Business Support Services (BSS) Manager, the Senior Software Development Leader is responsible for the end-to-end development and architecture of the company’s proprietary business and IT applications, making effective and efficient use of all Family’s development resources. The incumbent must have a successful track record of launching projects with C# and MVC computing technologies on an SQL platform.\r\n\r\nResponsibilities\r\n\r\nThis is a highly technical role. The incumbent will be expected to lead from a place of understanding, and to do so, they will develop an intimate understanding of the underlying technical architecture, as well as contributing to the future direction of the platform.\r\nGauge the effectiveness and efficiency of existing in-house developed systems; develop and implement strategies for improving or further leveraging existing technologies\r\nResearch emerging products, services, protocols, and standards in support of systems software development efforts\r\nDefine and enforce application architecture standards, ensuring scalability, security, and maintainability. Understand and translate business needs into technical solutions and vice versa\r\nProvide direction and approval for service level standards, policies, and operational guidelines as they pertain to the development environment\r\nDocument, analyze and continually improve procedures, problems and their resolution in the development team\r\nWork closely with other IT teams to ensure development handover, proper integration, testing support and business analysis support as required\r\nProvide incident and problem management support for all operational systems.\r\nEnsure coding standards, best practices and secure development processes are followed.\r\nArchitect, design and develop high-performance, scalable web and API solutions using .net Core/.Net Framework.\r\nWork with the BSS Manager and other IT leaders to establish and execute short and long-term architectural roadmaps for the business\r\nProvide strong development leadership, guidance, and support; build and maintain an effective development team through coaching and mentoring\r\nProvide operational back-up for all members of the development team.\r\n\r\nTechnical Skills\r\n\r\nProficient in OOAD/OOP/UML\r\nMust have .NET application development skills and be proficient in the following technologies:\r\nC# & T-SQL and be a current user\r\nSQL and SQL administration functions and query, and programming skills\r\nJavaScript (AJAX/JSON) and be a current user\r\nMVC (Razor), jQuery, LINQ, Angular and Entity Framework,\r\nWeb application development (HTML & CSS)\r\nRelated .Net technology stack\r\nIt would be an asset to have experience with:\r\nRecent experience using Knockout.js\r\nVB.NET experience\r\nMust have experience writing design documents\r\nMust have experience using .NET diagnostic tools to investigate and profile .NET applications\r\nProven training and experience in maintaining high-volume .net-based client-server business systems\r\nHands-on experience with Azure DevOps, REST APIs, MS architecture, Git, and version control practices.\r\n\r\nJob Requirements\r\n\r\nAbility to take initiative and provide direction to self and others\r\nProven ability to motivate others and work in a team environment\r\nAble to manage relationships with internal stakeholders and vendor partners in order to facilitate decision-making and problem resolution\r\nExcellent ability to analyze problems, find innovative solutions, translate technical details into business language and present those details to non-technical peers/managers\r\nExcellent verbal and written communication skills\r\n\r\nEducation and Experience\r\n\r\nMust have a technical or college degree in Information Systems or Computer Science\r\nMicrosoft Certified Solutions Developer App Builder certification required\r\n10+ years of relevant hands-on experience in a complex production environment\r\n5+ years’ experience recruiting, managing performance and leading a software development team\r\nPrior experience working within the insurance industry is an asset\r\n\r\nFor more current job opportunities, Follow MatchBox at linkedin.com/company/matchbox-recruitment/\r\n\r\n_________________________\r\n\r\nAbout MatchBox\r\nHeadquartered in downtown Vancouver and serving clients nationally, MatchBox is one of the leading recruitment and solutions firms that specializes in the fields of IT & Technology, Engineering & Technical, Real Estate & Construction, and Accounting & Finance. We offer unrivaled expertise with our team's extensive experience in the recruitment and professional services industry. We are dedicated to building great connections and creating strong opportunities within the workforce and the labor market.\r\n\r\nEqual Opportunities\r\nMatchBox is committed to providing equal opportunities for all applicants. We welcome and encourage applications from people of all backgrounds, including members of minority groups such as racialized individuals, people with disabilities, LGBTQ+ individuals, and Indigenous peoples. It is a priority for us that all candidates are treated fairly and without discrimination. Our recruitment teams receive ongoing training on using objective criteria for evaluating candidates and other related topics to create an inclusive and welcoming environment for all.\r\n\r\nWork Permits\r\nPlease note that we require all interested candidates to obtain the necessary work permits from the Government of Canada prior to submitting an application. This position is open exclusively to individuals residing in Canada and legally authorized to work in Canada. Applications not meeting these criteria will not be considered.\r\n\r\nFurther Consideration\r\nWe receive a high volume of applications and are only able to contact candidates who are selected for further consideration.\r\n\r\nFind out more at www.matchboxhr.com",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4248928578/",
    "Applicants": "Vancouver, BC · 5 days ago · 18 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Software Developer, .Net Desktop Application",
    "CompanyName": "Autodesk",
    "ContactHiringSection": "",
    "Description": "About the job\r\nJob Requisition ID #\r\n\r\n25WD87624\r\n\r\nFrench translation will follow/La traduction en français suivra\r\n\r\nPosition Overview\r\n\r\nAt Autodesk, we are revolutionizing how people design and make, empowering them to imagine, design, and make a better world. We have built the leading design and make Platform as a Service called Autodesk Platform Services used by Autodesk, our customers and industry partners. We are preparing the platform for another wave of hypergrowth.\r\n\r\nAutodesk's Developer Ecosystem team is seeking a motivated, experienced, and skilled engineer to join our team of talented and driven developers responsible for building and modernizing Autodesk Platform Services to reach its true potential as the leading Desing and Make platform.\r\n\r\nResponsibilities\r\n\r\nDesign and develop high-quality, secure, and performant features\r\nProvide project and team leadership to break down, estimate, and organize work\r\nParticipate in agile ceremonies of scrum team\r\nWork closely with product manager and team to understand and elaborate requirements\r\nWork with team to troubleshoot code-level problems quickly and efficiently\r\nParticipate in code reviews to ensure new code conforms to highest standards\r\nParticipate in technical and architectural discussions and decisions\r\nCollaborate with other teams for requirements and develop a cohesive technical strategy for seamless service and system integration\r\n\r\nMinimum Qualifications\r\n\r\nBS in computer science or related technical field (MS in Computer Science or a related degree is preferred)\r\nOver 4 years of professional experience developing scalable, distributed applications\r\nExperience designing and building RESTful APIs using Microservices architecture\r\nStrong experience with building cloud-based API platforms or backend systems\r\nBroad knowledge of AWS, Azure, databases, and cloud architectures\r\nStrong experience and understanding of working on Agile processes like SCRUM\r\nStrong communication skills, and ability to influence without authority\r\n2+ years experience developing Windows-based applications with substantial user base (.Net, COM, MFC, etc.)\r\nRecent hands-on experience with one or more languages – C#, C++\r\nExperience in programming languages like Java, JavaScript and React JS\r\nExperience working with remote teams and other cross-functional stakeholders\r\nGood self-management skills and ability to track and prioritize multiple tasks coming in simultaneously\r\nExperience modernizing legacy cloud services\r\n\r\nDescription Du Poste\r\n\r\nChez Autodesk, nous révolutionnons la façon dont les gens conçoivent et fabriquent, en leur donnant les moyens d'imaginer, de concevoir et de créer un monde meilleur. Nous avons construit la principale plateforme de conception et de fabrication en tant que service appelée Autodesk Platform Services, utilisée par Autodesk, nos clients et nos partenaires industriels. Nous préparons la plateforme pour une nouvelle vague d'hypercroissance.\r\n\r\nL'équipe de l'écosystème des développeurs d'Autodesk recherche un ingénieur motivé, expérimenté et compétent pour rejoindre notre équipe de développeurs talentueux et motivés, chargés de construire et de moderniser Autodesk Platform Services afin qu'elle atteigne son véritable potentiel en tant que plateforme leader de conception et de fabrication.\r\n\r\nResponsabilités\r\n\r\nConcevoir et développer des fonctionnalités de haute qualité, sécurisées et performantes\r\nAssurer la direction de projets et d'équipes pour décomposer, estimer et organiser le travail\r\nParticiper aux cérémonies agiles de l'équipe Scrum\r\nTravailler en étroite collaboration avec le chef de produit et l'équipe pour comprendre et élaborer les exigences\r\nTravailler avec l'équipe pour résoudre rapidement et efficacement les problèmes au niveau du code\r\nParticiper aux révisions de code pour s'assurer que le nouveau code est conforme aux normes les plus strictes\r\nParticiper aux discussions et aux décisions techniques et architecturales\r\nCollaborer avec d'autres équipes pour les exigences et développer une stratégie technique cohérente pour un service et une intégration système sans faille\r\n\r\nQualifications Minimales\r\n\r\nLicence en informatique ou dans un domaine technique connexe (une maîtrise en informatique ou un diplôme connexe est préférable)\r\nPlus de 4 ans d'expérience professionnelle dans le développement d'applications distribuées et évolutives\r\nExpérience dans la conception et la construction d'API RESTful utilisant l'architecture Microservices\r\nSolide expérience dans la construction de plateformes API ou de systèmes backend basés sur le cloud\r\nVaste connaissance des architectures AWS, Azure, des bases de données et du cloud\r\nSolide expérience et compréhension du travail sur des processus Agile tels que SCRUM\r\nSolides compétences en communication et capacité à influencer sans autorité\r\nPlus de 2 ans d'expérience dans le développement d'applications Windows avec une base d'utilisateurs importante (.Net, COM, MFC, etc.)\r\nExpérience pratique récente avec un ou plusieurs langages - C#, C++\r\nExpérience des langages de programmation tels que Java, JavaScript et React JS\r\nExpérience de travail avec des équipes distantes et d'autres parties prenantes interfonctionnelles\r\nBonnes compétences en autogestion et capacité à suivre et à hiérarchiser plusieurs tâches simultanées\r\nExpérience de la modernisation des services cloud existants\r\n\r\nLearn More / Plus d'information\r\n\r\nAbout Autodesk / À Propos D’Autodesk\r\n\r\nWelcome to Autodesk! Amazing things are created every day with our software – from the greenest buildings and cleanest cars to the smartest factories and biggest hit movies. We help innovators turn their ideas into reality, transforming not only how things are made, but what can be made.\r\n\r\nWe take great pride in our culture here at Autodesk – our Culture Code is at the core of everything we do. Our values and ways of working help our people thrive and realize their potential, which leads to even better outcomes for our customers.\r\n\r\nWhen you’re an Autodesker, you can be your whole, authentic self and do meaningful work that helps build a better future for all. Ready to shape the world and your future? Join us!\r\n\r\nBienvenue à Autodesk ! Des choses incroyables sont créées chaque jour avec nos logiciels - des bâtiments les plus écologiques et des voitures les plus propres aux usines les plus intelligentes et aux plus grands films à succès. Nous aidons les innovateurs à transformer leurs idées en réalité, transformant non seulement la façon dont les choses sont faites, mais ce qui peut être fait.\r\n\r\nNous sommes très fiers de notre culture ici chez Autodesk - notre code en matière de culture est au cœur de tout ce que nous faisons. Nos valeurs et nos méthodes de travail aident nos employés à prospérer et à réaliser leur potentiel, ce qui conduit à des résultats encore meilleurs pour nos clients.\r\n\r\nLorsque vous êtes un employé Autodesk, vous pouvez être entier et authentique et effectuer un travail significatif qui aide à construire un avenir meilleur pour tous. Prêt à façonner le monde et votre avenir? Joignez-vous à nous !\r\n\r\nSalary transparency / Transparence salariale\r\n\r\nSalary is one part of Autodesk’s competitive compensation package. Offers are based on the candidate’s experience and geographic location. In addition to base salaries, we also have a significant emphasis on discretionary annual cash bonuses, commissions for sales roles, stock or long-term incentive cash grants, and a comprehensive benefits package.\r\n\r\nLe salaire est l'un des éléments de l'offre compétitive d'Autodesk. Les offres sont basées sur l'expérience et la situation géographique du candidat. Outre les salaires de base, nous accordons également une grande importance aux primes annuelles discrétionnaires en espèces, aux commissions pour les fonctions de vente, aux actions ou aux primes d'encouragement à long terme en espèces, ainsi qu'à un ensemble complet d'avantages sociaux.\r\n\r\nDiversity & Belonging / Diversité et appurtenance\r\n\r\nWe take pride in cultivating a culture of belonging and an equitable workplace where everyone can thrive. Learn more here: https://www.autodesk.com/company/diversity-and-belonging\r\n\r\nNous sommes fiers de cultiver une culture d’appartenance et un milieu de travail équitable où tout le monde peut s’épanouir. Pour en savoir plus, cliquez ici : https://www.autodesk.com/company/diversity-and-belonging\r\n\r\nAre you an existing contractor or consultant with Autodesk? \r\n\r\nÊtes-vous un sous-traitant ou un consultant existant d’Autodesk ?\r\n\r\nPlease search for open jobs and apply internally (not on this external site).\r\n\r\nVeuillez rechercher des emplois vacants et postuler à l’interne (pas sur ce site externe).",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4209303500/",
    "Applicants": "Vancouver, BC · Reposted 1 day ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Senior Software Developer (.Net)",
    "CompanyName": "Benevity",
    "ContactHiringSection": "",
    "Description": "About the job\r\nMeet Benevity \r\n\r\nBenevity is the way the world does good, providing companies (and their employees) with technology to take social action on the issues they care about. Through giving, volunteering, grantmaking, employee resource groups and micro-actions, we help most of the Fortune 100 brands build better cultures and use their power for good. We’re also one of the first B Corporations in Canada, meaning we’re as committed to purpose as we are to profits. We have people working all over the world, including Canada, Spain, Switzerland, the United Kingdom, the United States and more!\r\n\r\nBenevity is on a dynamic growth trajectory, where embracing change is part of our DNA. We're on the lookout for a Senior Software Developer who thrives in a fast-paced environment and values collaboration in a diverse and inclusive team setting. The ideal candidate will have a robust background in software development, including expertise in debugging, code review, and testing. You'll play a pivotal role in tackling complex challenges, designing, and developing innovative solutions, and leading projects from conception to delivery. Your contributions will not only involve working closely with technical leaders and various teams to exceed client expectations but also providing mentorship to enhance the team's technical skills and foster a culture of high performance.\r\n\r\nWe are committed to diversity and inclusion, inviting applications from candidates with a range of professional experiences. We encourage you to apply, even if you don't meet every criterion listed, and join us in our mission to drive positive change.\r\n\r\n What You’ll Do \r\n\r\nRefactor legacy .Net Framework components to .Net Core with RESTful APIs and modular design principals\r\nWrite and refactor VueJS single page applications that adopt our internal design system and enable modern UX and UI expectations\r\nFocus on crafting production-level code that is clean, modular, and thoroughly documented, while strictly adhering to coding standards and best practices\r\nEngage in collaborative efforts to define and document requirements, ensuring clarity, task breakdown, and accurate time estimates\r\nEngage in research and the creation of proofs of concept to support reliable implementation and transformation plans that result in highly confident execution plans \r\nTake a leadership role in sprint refinement and planning sessions, guiding development strategies and promoting an efficient software development life cycle (SDLC)\r\nEnsure the highest quality of software is released through designing scalable testing and debugging frameworks that align with our architecture principals\r\nDevelop and maintain standardized models for data, software, and network architecture that meet organizational standards and promote effective information exchange\r\nLead in identifying and analyzing the root causes of issues during testing phases and incident management\r\nActively participate in code reviews to elevate code quality and maintain consistency across projects. Work on optimizing and refactoring existing systems and legacy code to boost performance and scalability\r\nOversee the CI/CD pipeline management for swift and secure code deployment. Improve the CI/CD pipeline to promote developer experience and efficiency\r\nRegularly monitor the performance, security, and user experience of all applications under your team's purview, identifying and addressing areas for improvement with a focus on continuous enhancement\r\n\r\n What You’ll Bring \r\n\r\nSeeking a candidate with a Computer Science degree or equivalent experience, bringing over 5 years of experience in high-performance, full-stack software development\r\nYou should have 5+ years expertise in .Net (Framework and/or Core)\r\nExperience and familiarity with Vue (or Angular, React)\r\n3+ years in cloud hosted infrastructures such as AWS or Azure DevOps. You are comfortable (and desire) developing in Terraform\r\nYour skill set should encompass advanced database design across MS SQL Server, expertise in developing with XML and REST APIs and proficiency in Git and platforms like GitHub/Azure DevOps for version control and collaboration\r\nWe value problem-solving skills, especially in ambiguous situations, and the ability to design, build, and deploy scalable and resilient systems\r\nQuality is paramount; we expect a demonstrated pride in delivering high-quality, maintainable, and scalable software\r\nYour experience should also include working with legacy systems, optimizing existing software, and fostering a growth mindset to continually improve code quality and processes\r\nStrong communication skills are essential for understanding user needs and translating them into effective solutions\r\nWe encourage candidates who are committed to continuous learning, process optimization, and mentoring within a diverse and inclusive team environment\r\n\r\n Discover your purpose at work \r\n\r\nWe’re not employees, we’re Benevity-ites. From all locations, backgrounds and walks of life, who deserve more …\r\n\r\nInnovative work. Growth opportunities. Caring co-workers. And a chance to do work that fills us with a sense of purpose.\r\n\r\nIf the idea of working on tech that helps people do good in the world lights you up ... If you want a career where you’re valued for who you are and challenged to see who you can become …\r\n\r\nIt’s time to join Benevity. We’re so excited to meet you.\r\n\r\n Where we work \r\n\r\nAt Benevity, we embrace a flexible hybrid approach to where we work that empowers our people in a way that supports great work, strong relationships, and personal well-being. For those located near one of our offices, while there’s no set requirement for in-office time, we do value the moments when coming together in person helps us build connection and collaboration. Whether it’s for onboarding, project work, or a chance to align and bond as a team, we trust our people to make thoughtful decisions about when showing up in person matters most.\r\n\r\n Join a Company Where DEIB Isn’t a Buzzword \r\n\r\nDiversity, equity, inclusion and belonging are part of Benevity’s DNA. You’ll see the impact of our massive investment in DEIB daily — from our well-supported employee resources groups to the exceptional diversity on our leadership and tech teams.\r\n\r\nWe know that diverse backgrounds, experiences, skills and passions are what move our business and our people forward, so we're committed to creating a culture of belonging with equal opportunities for everyone to shine.\r\n\r\nThat starts with a fair and accessible hiring process. If you want to feel seen, heard and celebrated, you belong at Benevity.\r\n\r\nCandidates with disabilities who may require accommodations throughout the hiring or assessment process are encouraged to reach out to accommodations@benevity.com.",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4214373434/",
    "Applicants": "Greater Vancouver Metropolitan Area · 1 month ago · 59 people clicked apply\r\nResponses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Senior Developer, Trading & Compliance Systems",
    "CompanyName": "Connor, Clark & Lunn Financial Group (CC&L)",
    "ContactHiringSection": "",
    "Description": "About the job\r\nConnor, Clark & Lunn Financial Group Ltd.\r\n\r\nVancouver, BC\r\n\r\nAs passionate developers, we are faced with complex problems that are ideally solved with technology. Applying technology to investment problems has been key to the firm’s success and plays an increasingly significant role in the evolution of the firm and the industry. Our Trading & Compliance systems handles thousands of orders per day in more than 40 countries around the world.\r\n\r\nThe team is headquartered in Vancouver, Canada, with presence in India to better support our growing 24-hour business. We place high value on maintaining an entrepreneurial spirit and creating a culture where each of us has opportunities to succeed.\r\n\r\nWe are looking for a senior developer. To apply for this position, submit your resume and cover letter. We thank all applicants in advance for their interest, but only those candidates shortlisted for interviews will be contacted. No telephone calls or recruitment agencies will be accepted.\r\n\r\nWhat You Will Do\r\n\r\nDevelopers play an essential role in keeping the business running today and ensuring it can grow for tomorrow. You own the entire software life cycle:\r\n\r\nCollaborate with portfolio managers, traders and back-office users to solve business problems and improve efficiencies. Invest time and effort to learn about our order management system and how it integrates with other systems, end users and processes within CC&L\r\nDesign, plan and implement solutions in an entrepreneurial spirit.\r\nKeep trading and compliance systems running smoothly through enhancements and operational support.\r\nKeep up to date on new technology and industry best practices and how we can apply them within the team.\r\nAbout You\r\nContinuous Improvement – you love to make things better, whether it is a technical problem, improving a business process or workflow within the team.\r\nCollaborative Communication – you are collaborative, you like people as much as you like technology, you work well with others and communicate effectively.\r\nProblem Solver – you possess an analytical mind and enjoy solving business and technical problems.\r\nAutomation – you dislike doing the same thing twice when a machine could do it for you. Experience working on Azure DevOps is advantageous.\r\nProgramming Knowledge – You value well-designed code and have solid programming skills in C#, Angular/Typescript, PowerShell, SQL, or similar languages. Experience of building on Microsoft Azure is desirable.\r\nInterest in Investment Management – an interest in learning the details of a broad range of asset classes is essential to succeed in this role. Previous experience working with Charles River Investment Management Solution (CRIMS) is advantageous.\r\n\r\nThe salary range for this position is $120,000 to $140,000. The salary range provided reflects the base salary range for this position as required by legislation. In addition, there is an annual performance bonus which contributes to the total compensation of this position. Further questions may be directed to the HR team during the interview process.\r\n\r\nAbout Connor, Clark & Lunn Financial Group\r\n\r\nAt CC&L Financial Group, we understand the value of opportunity – for our clients and our team. Independent and employee-owned, we partner with investment professionals to grow successful asset management businesses, giving them the space to innovate and truly make an impact. \r\n\r\nWith more than 40 years of history and offices across Canada and in the US, the UK and India, CC&L Financial Group and our multi-boutique family of affiliate firms collectively manage over $142 billion in client assets, providing a diverse range of traditional and alternative investment products and solutions to institutional, high-net-worth and retail clients. \r\n\r\nFor a closer look at how you can build your career with us, we invite you to explore cclgroup.com. \r\n\r\nCC&L Financial Group is committed to creating a diverse and inclusive environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to gender, ethnicity, religion, sexual orientation or expression, disability, or age. \r\n\r\nTo apply for this position, please submit your resume and cover letter as one PDF. \r\n\r\nWe thank all applicants in advance for their interest, but only those candidates shortlisted for interviews will be contacted. No telephone calls or recruitment agencies will be accepted. \r\n\r\nApply for this Position",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4066112398/",
    "Applicants": "Vancouver, BC · Reposted 1 week ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Software Development Analyst - FTT",
    "CompanyName": "TransLink",
    "ContactHiringSection": "",
    "Description": "About the job\r\nMarketing Statement \r\nA career at TransLink and our family of companies means working with people with a wide range of skills and perspectives, all teaming up towards a common goal: preserving and enhancing the region's world-envied quality of life. Together, we connect the region and enhance its livability by providing a sustainable transit and transportation network, embraced by our communities and people.\r\nAt TransLink we are dedicated to building a workforce that reflects the diversity of the communities in which we live. We’re committed to fostering an inclusive, equitable and accessible workplace, recognizing the unique value and skills every individual brings.\r\nLooking for a great place to work where your contributions are valued and you can make a difference in a vibrant city? At TransLink, one of BC’s Top Employers, you'll help make Metro Vancouver a better place to live, built on transportation excellence. Put your future in motion!\r\nResponsibilities\r\nDesigns, develops, deploys and tests software applications and application interfaces, and works collaboratively with peers and stakeholders to ensure that all information systems programs and projects meet development standards for usability, operability, performance, and end-user requirements. Analyses business requirements and contributes to the application architecture, integration, technology choices and development strategy. Provides technical support to maintain and improve quality of software applications. Contributes to continuous improvement of the software development processes, practices and tools.\r\nEducation\r\n Qualifications \r\nDiploma in computer science, computer systems engineering, software engineering, or mathematics from a recognized university or technology institution with courses in business and systems analysis, software design and programming, and use of software development tools.\r\nExperience\r\nRequires three (3) years of recent related experience in the development of highly scalable and robust commercial software and web applications, utilizing tools and information engineering techniques, software design patterns, development methodologies, best practices, and client-side web technologies.\r\nA further period of up to one (1) year in the position is required to become familiar with TransLink’s information systems, policies, procedures, environment and its user requirements, as well as corporate road maps.\r\nOther Information\r\nWe are seeking for 2 Software Development Analysts to support the development and maintenance of mission-critical transit fare systems. The ideal candidate will bring a strong background in software development, with a focus on building scalable, secure, and maintainable applications. Key qualifications include:\r\nProficiency in C# and the .NET framework, with experience developing enterprise-grade applications\r\nFamiliarity with Terraform for infrastructure as code and JavaScript for front-end or full-stack development is considered an asset\r\nRecruitment Process: An applicant will be required to demonstrate their suitability for this position by meeting the minimum level of qualifications and experience in order to be invited into the selection process. A standard interview format will be used including general, scenario and behavioural descriptive interview questions.\r\n Work Schedule \r\n37.5 hours per week.\r\nThis is a full-time temporary position with an approximate end date of May 29, 2026.\r\n Work Designation \r\nHybrid\r\nThis position offers the flexibility of working both on-site and remotely within B.C.\r\n Rate of Pay \r\nSalary $8,236.33 - $9,896.62 per month (Actual salary offered will be commensurate with education, experience and internal parity).\r\nThe Total Compensation Package includes Extended Health, Transit Pass and enrollment in the Public Service Pension Plan upon eligibility. Focus on your development through training, and mentorship programs. Enjoy a variety of health and wellness programs, including access to gym facilities. Speak to us to know more about what we offer.\r\nHow To Apply\r\nPlease click the 'Apply' button at the top right corner of the page or go to http://www.translink.ca/careers to apply for this position and view instructions on the process.\r\nINSTRUCTIONS: Please save your (1) cover letter, and your (2) resume as one pdf document prior to uploading your application on-line.\r\nPosting Date: May 27, 2025\r\nClosing Date: Open until filled\r\nPlease note that only those short listed will be contacted.\r\nHaving trouble applying? Please view the System Requirements & FAQ's by going to http://www.translink.ca/careers.\r\n Equal Employment Opportunity \r\nTransLink is committed to employment equity and building a diverse workforce, representative of the customers we serve and the many communities in the Metro Vancouver region. We welcome and encourage Indigenous applicants, people of colour, all genders, 2SLGBTQ+ and persons with disabilities to apply. Learn more about TransLink's commitment to equity, diversity and inclusion.\r\nAccommodations are available on request for candidates taking part in all aspects of the selection process. For a confidential inquiry, simply email us at jobs@translink.ca.",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4236262543/",
    "Applicants": "Vancouver, BC · Reposted 19 hours ago · 78 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Staff Software Engineer",
    "CompanyName": "Press Ganey",
    "ContactHiringSection": "",
    "Description": "About the job\r\nCompany Description\r\n\r\nPG Forsta is the leading experience measurement, data analytics, and insights provider for complex industries—a status we earned over decades of deep partnership with clients to help them understand and meet the needs of their key stakeholders. Our earliest roots are in U.S. healthcare –perhaps the most complex of all industries. Today we serve clients around the globe in every industry to help them improve the Human Experiences at the heart of their business. We serve our clients through an unparalleled offering that combines technology, data, and expertise to enable them to pinpoint and prioritize opportunities, accelerate improvement efforts and build lifetime loyalty among their customers and employees.\r\n\r\nLike all great companies, our success is a function of our people and our culture. Our employees have world-class talent, a collaborative work ethic, and a passion for the work that have earned us trusted advisor status among the world’s most recognized brands. As a member of the team, you will help us create value for our clients, you will make us better through your contribution to the work and your voice in the process. Ours is a path of learning and continuous improvement; team efforts chart the course for corporate success.\r\n\r\nOur Mission\r\n\r\nWe empower organizations to deliver the best experiences. With industry expertise and technology, we turn data into insights that drive innovation and action.\r\n\r\nOur Values\r\n\r\nTo put Human Experience at the heart of organizations so every person can be seen and understood.\r\n\r\nEnergize the customer relationship: Our clients are our partners. We make their goals our own, working side by side to turn challenges into solutions. \r\nSuccess starts with me: Personal ownership fuels collective success. We each play our part and empower our teammates to do the same. \r\nCommit to learning: Every win is a springboard. Every hurdle is a lesson. We use each experience as an opportunity to grow. \r\nDare to innovate: We challenge the status quo with creativity and innovation as our true north. \r\nBetter together: We check our egos at the door. We work together, so we win together. \r\n\r\nWant to be part of our team? Now is the time to apply, as we are currently looking for a skilled and curious Senior Software Engineer to join our team in Vancouver. \r\n\r\nYour role will require and challenge you to: \r\n\r\nWork with Product Managers and frontend developers \r\nImprove code quality through pair programming and code reviews \r\nIdentify and communicate best practices \r\nDesign and build REST based Microservices on .Net/.Net Core using C# and ASP.NET Web API \r\nHave the right mindset to build and ship high-quality code to production every day \r\nHandle security aspects while designing and coding, not as an afterthought \r\nHave an open mind on tooling and languages \r\nTake pride in what you deliver \r\nBe proactive and self-driven \r\nBe a strong team player and prefer to work with others in all phases of the development process \r\nEnjoy collaborating across borders in an international environment \r\n\r\nWhat you bring: \r\n\r\nBS or MS degree in Computer Science or a related technical field \r\n5+ years of experience in backend development with C# and .NET Core/.NET6+ \r\nStrong expertise in Identity and Access Management (IAM) \r\nExperience with IdentityServer (Duende IdentityServer, IdentityServer4) or other OAuth2/OpenID Connect providers \r\nDeep understanding of authentication and authorization protocols (OAuth2, OpenID Connect, SAML, JWT) \r\nProficiency in ASP.NET Core for implementing authentication and authorization solutions \r\nStrong knowledge of API security best practices, including token-based authentication and role-based access control (RBAC) \r\nExperience working with federated identity management and SSO (Single Sign-On) \r\nFamiliarity with PKCE, refresh tokens, and client credentials flow \r\nUnderstanding of security best practices such as encryption, hashing, and secure storage of credentials \r\nStrong experience in RESTful API design and implementation \r\nProficiency in SQL databases \r\nUnderstanding of microservices architecture and distributed systems \r\nKnowledge of asynchronous programming and multithreading in C# \r\nStrong understanding of software design patterns and best practices \r\nExperience with unit testing, integration testing \r\nAbility to write high-performing, testable, and reusable code \r\nFluent in English (our working language) \r\nWhile we put mindset and being a team player at the top of the list, you get additional points if you are familiar with, or have good knowledge of, any of the following: \r\nAbility to design and architect scalable backend systems \r\nAbility to collaborate with security teams to ensure compliance with security standards \r\nFamiliarity with CI/CD pipelines, version control (Git), and DevOps practices \r\nExperience with docker, Kubernetes, cloud platforms (Azure) \r\nExperience with message brokers (e.g., RabbitMQ, Kafka) \r\nGit, Jira, Confluence, Slack, Grafana, TeamCity \r\nExperience integrating with Active Directory (AD), Azure AD, and third-party identity providers \r\n\r\nDon’t meet every single requirement? Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At Press Ganey we are dedicated to building a diverse, inclusive and authentic workplace, so if you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles.\r\n\r\nAdditional Information For US Based Jobs\r\n\r\nPress Ganey Associates LLC is an Equal Employment Opportunity/Affirmative Action employer and well committed to a diverse workforce. We do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, veteran status, and basis of disability or any other federal, state, or local protected class.\r\n\r\nPay Transparency Non-Discrimination Notice – Press Ganey will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information.\r\n\r\nThe expected base salary for this position ranges from $120,000 to $150,000. It is not typical for offers to be made at or near the top of the range. Salary offers are based on a wide range of factors including relevant skills, training, experience, education, and, where applicable, licensure or certifications obtained. Market and organizational factors are also considered. In addition to base salary and a competitive benefits package, successful candidates are eligible to receive a discretionary bonus or commission tied to achieved results.\r\n\r\nAll your information will be kept confidential according to EEO guidelines.\r\n\r\nOur privacy policy can be found here: https://www.pressganey.com/legal-privacy/",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4205250174/",
    "Applicants": "Vancouver, BC · Reposted 6 days ago · 83 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn",
    "SearchText": "C# Developer"
  },
  {
    "JobOfferTitle": "Canada: Developer",
    "CompanyName": "ScanSource",
    "ContactHiringSection": "",
    "Description": "About the job\r\nJob Details\r\n\r\nDescription\r\n\r\nJob Summary:\r\n\r\nScanSource is looking to hire a developer to work as part of our development team. This team is leading the effort to fully leverage Microsoft and other technologies to drive solutions and address business opportunities for our internal and partner user base. The ScanSource development team is located all over the world, so we are looking for a remote candidate with a little more consideration for candidates on the US West Coast.\r\n\r\nThe qualified candidate will have a strong team-oriented mindset along with an understanding of general software engineering concepts and be responsible for working on full lifecycle engineering efforts using Agile methodologies, object-oriented design, and accepted design patterns and practices. This includes architectural design, coding, unit testing, release management, and creating and maintaining existing applications. A strong candidate will also have a good grasp on SQL Server data tools.\r\n\r\nIn addition to technical skills, a good candidate will show a strong ability to work as a team member and mentor junior team members, through design and code reviews, as well as helping them grow in non-technical areas such as communication.\r\n\r\nEssential Job Duties\r\n\r\nDevelop, test, and document working development, integrations, and data migrations\r\nContribute to overall code quality by performing solution and code reviews for fellow developers\r\nContinuous improvement of development processes such as Agile, CI/CD, etc.\r\nCommunicate effectively with a globally distributed team\r\nUpdate, maintain and Support legacy applications\r\nWork with PMO to design, develop, and implement prioritized items\r\nIntegrate multiple systems, including internal proprietary and third-party applications\r\nMust be willing to support PST hours.\r\n\r\nRequired Qualifications, Skills And Experience\r\n\r\nJava – Full Stack, Web API, REST, SOAP, XML, JSON, Java-Script, APEX\r\nFoxPro\r\nSQL - Extensive experience with TSQL, using and debugging queries against MS SQL required\r\nObject oriented programming, including design patterns\r\nADA web compliance best practices\r\nExperience with Microsoft Visual Studio Data Tools\r\nKnowledge of how to design and consume RESTful and SOAP APIs\r\nExperience in Agile software development with iterative development methodologies: Thru JIRA and GitHub \r\n\r\nPreferred Qualifications, Skills And Experience\r\n\r\nSSRS, SSAS, SSIS\r\nSalesforce – both classic and lightning\r\nKnowledge of Braintree, Forte, Avalara, FedEx, UPS, APIs preferred\r\n\r\nPhysical Requirements\r\n\r\nAbility to sit at a computer terminal for long periods of time\r\nAbility to work remotely\r\n\r\nCompensation\r\n\r\nCompensation Range: $75,000 - $95,000 CAD\r\n\r\nActual annual salary offered to a candidate will be based on a number of variables including work experience, education and skills/ achievements, and will be mutually agreed upon at the time of offer. This position is not eligible for a variable pay component as part of the hiring range.\r\n\r\nWhile we’re committed to providing top-tier solutions, we’re just as committed to supporting our own team. Our employees enjoy a variety of comprehensive benefits, including medical/dental/vision coverage, life insurance, and a 401(k) plan with matching provision. Outside of CA, ScanSource grants 128 hours of paid time off (PTO) each calendar year (prorated for date of hire). In the state of CA, employees accrue a set number of hours each pay period equaling the same 128 hours of PTO. ScanSource also celebrates 10 paid company holidays.\r\n\r\nScanSource, Inc. is an Equal Opportunity Employer\r\n\r\nEOE/M/F",
    "SalaryOrBudgetOffered": "",
    "Link": "https://www.linkedin.com/jobs/view/4219985001/",
    "Applicants": "Vancouver, BC · 1 month ago · Over 100 people clicked apply\r\nResponses managed off LinkedIn",
    "SearchText": "C# Developer"
  }
]